zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_v3.c
uint32_t Cy_CapSense_GetPolySize(uint32_t lfsrPoly);

#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_SMARTSENSE_EN)
void Cy_CapSense_SsAutoTuneScanDurationAlignment(
                uint64_t widgetMask,
                uint32_t clockDivider,
                uint32_t subConversion,
                cy_stc_capsense_context_t * context);
#endif
#if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD)
#if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN) ||\
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN))
void Cy_CapSense_SetCompDivider(
                uint32_t widgetId,
                cy_stc_capsense_context_t * context);
void Cy_CapSense_SetMaxCompCdac(
                uint32_t widgetId,
                cy_stc_capsense_context_t * context);
#endif
#endif /* (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD) */

#if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
#if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CDAC_COMP_USAGE) ||\
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CDAC_COMP_USAGE))
void Cy_CapSense_AmuxUpdateCdacComp(
                MSC_Type * base,
                const cy_stc_capsense_sensor_context_t * ptrSnsContext);
#endif

void Cy_CapSense_AmuxUpdateScanConfig(
                uint32_t chIndex,
                uint32_t scanSlot,
                uint32_t prevWdIndex,
                cy_stc_capsense_context_t * context);

void Cy_CapSense_AmuxStartScan(MSC_Type * base);
#endif


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CDAC_AUTO_DITHER_EN)
static cy_capsense_status_t Cy_CapSense_CdacDitherScaleCalc(
                cy_stc_capsense_context_t * context);
static cy_capsense_status_t Cy_CapSense_ConfigureAutoDitherMode(
                cy_stc_capsense_context_t * context);
static cy_capsense_status_t Cy_CapSense_CdacDitherConfigScan(
                MSC_Type * ptrHwBase,
                uint32_t chId,
                uint32_t slotId,
                uint32_t snsFrameIdx,
                cy_stc_capsense_context_t * context);
#endif


/** \} \endcond */


/*******************************************************************************
* Function Name: Cy_CapSense_ScanSlots_V3
****************************************************************************//**
*
* Initiates the non-blocking scan of specified slots. 
*
* This function initiates a scan only for the first specified slot for all channels
* and then exits. Scans for the remaining slots in the interrupt-driven scan mode
* are initiated
* in the interrupt service routine (part of middleware) triggered at the end
* of each scan completion for each channel. If the syncMode field in the
* cy_stc_capsense_common_config_t structure is set to CY_CAPSENSE_SYNC_MODE_OFF,
* then the next slot scan for the channel with the fired interrupt,
* will start regardless of the another channel readiness for the next scan.
* If the syncMode field is set to CY_CAPSENSE_SYNC_INTERNAL (for single-chip projects)
* or to CY_CAPSENSE_SYNC_EXTERNAL (for multi-chip projects),
* then the next slot scan for the channel with the fired interrupt,
* will start in lockstep with another channels after they all are ready
* for the next scan.
* The scan for the remaining slots in CS-DMA scan mode are initiated
* by DMAC triggered at the end
* of each scan completion for each channel. The channel scan synchronization is
* performed as in Interrupt-driven scan mode. After all slots are scanned,
* the FRAME interrupt is fired and the interrupt service routine (part of middleware)
* updates the busy status.
* To decrease the start scan time when it is intended to scan the same slot,
* i.e. the startSlotId parameter is the same and numberSlots = 1u, then the scan
* is performed without the MSC HW block reconfiguration. Also, in the AMUX mode
* sensors are not disconnected.
*
* If the middleware is busy, do not initiate a new scan or set up widgets.
* Use the Cy_CapSense_IsBusy() function to check HW busyness at a particular moment.
* Use the Cy_CapSense_MwState() function to verify if MW executes any firmware 
* tasks related to initialization, scanning, and processing at a particular moment.
*
* \note
* This function is available only for the fifth-generation CAPSENSE&trade;.
*
* \param startSlotId
* The slot ID scan will be started from.
*
* \param numberSlots
* The number of slots will be scanned.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS          - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_BAD_PARAM        - The input parameter is invalid.
* - CY_CAPSENSE_STATUS_HW_BUSY          - The HW is busy with the previous scan.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_ScanSlots_V3(
                uint32_t startSlotId,
                uint32_t numberSlots,
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t capStatus = CY_CAPSENSE_STATUS_BAD_PARAM;

    uint32_t curChIndex;
    uint32_t startSlotIdLocal = startSlotId;
    uint32_t numberSlotsLocal = numberSlots;
    uint32_t lastSlot = startSlotIdLocal + numberSlotsLocal - 1u;
    const cy_stc_capsense_common_config_t * ptrCommonCfg;
    cy_stc_capsense_internal_context_t * ptrIntrCxt;
    uint32_t slotValue;
    uint32_t curSlotIndex;
    #if (CY_CAPSENSE_SCAN_MODE_INT_DRIVEN == CY_CAPSENSE_SCAN_MODE)
        uint32_t wdIndex;
        uint32_t snsIndex;
        uint32_t scanSlotIndexValid;
    #endif

    #if ((CY_CAPSENSE_SCAN_MODE_INT_DRIVEN == CY_CAPSENSE_SCAN_MODE) || \
         (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD))
        uint32_t * ptrSensorFrame;
    #endif

    #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
        uint32_t sensorFrame[CY_MSC_6_SNS_REGS] = {0u, 0u, 0u, 0u, 0u, 0u};
    #endif

    if ((NULL != context) && (0u != numberSlotsLocal))
    {
        if (CY_CAPSENSE_SLOT_COUNT > lastSlot)
        {
            ptrIntrCxt = context->ptrInternalContext;
            ptrCommonCfg = context->ptrCommonConfig;

            #if (CY_CAPSENSE_SCAN_MODE_INT_DRIVEN == CY_CAPSENSE_SCAN_MODE)
                /* Finds the first enabled slot for scanning */
                while (0u < numberSlotsLocal)
                {
                    if (0u != Cy_CapSense_IsSlotEnabled(startSlotIdLocal, context))
                    {
                        break;
                    }
                    startSlotIdLocal++;
                    numberSlotsLocal--;
                }
                /* Finds the last valid slot */
                while (0u < numberSlotsLocal)
                {
                    if (0u != Cy_CapSense_IsSlotEnabled(lastSlot, context))
                    {
                        break;
                    }
                    lastSlot--;
                    numberSlotsLocal--;
                }
            #endif

            #if (CY_CAPSENSE_SCAN_MODE_INT_DRIVEN == CY_CAPSENSE_SCAN_MODE)
                if (0u == numberSlotsLocal)
                {
                    capStatus = CY_CAPSENSE_STATUS_BAD_PARAM;
                }
                else
            #endif
            if (CY_CAPSENSE_NOT_BUSY != Cy_CapSense_IsBusy(context))
            {
                /* Previous widget is being scanned. Return error. */
                capStatus = CY_CAPSENSE_STATUS_HW_BUSY;
            }
            else
            {
                if ((CY_CAPSENSE_HW_CONFIG_REGULAR_SCANNING == ptrIntrCxt->hwConfigState) &&
                    (ptrIntrCxt->currentSlotIndex == startSlotIdLocal) && (1u == numberSlotsLocal) &&
                    (0u == (context->ptrCommonContext->status & CY_CAPSENSE_MW_STATE_CALIBRATION_MASK)) &&
                    (ptrIntrCxt->scanSingleSlot == CY_CAPSENSE_SCAN_SNGL_SLOT))
                {
                    #if (CY_CAPSENSE_SCAN_MODE_INT_DRIVEN == CY_CAPSENSE_SCAN_MODE)
                        /* Initiates the frame start for each channel in interrupt driven scan mode */
                        for (curChIndex = 0u; curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; curChIndex++)
                        {
                            ptrCommonCfg->ptrChConfig[curChIndex].ptrHwBase->FRAME_CMD =
                              MSC_FRAME_CMD_START_FRAME_Msk;
                        }
                    #endif /* (CY_CAPSENSE_SCAN_MODE_INT_DRIVEN == CY_CAPSENSE_SCAN_MODE) */

