zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_v3.c
                    /* Initialize all enabled MSC channels for scan */
                    for (curChIndex = 0u; curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; curChIndex++)
                    {
                        Cy_CapSense_SetBusyFlags(curChIndex, context);

                        if (NULL != ptrIntrCxt->ptrSSCallback)
                        {
                            ptrIntrCxt->ptrSSCallback((cy_stc_capsense_active_scan_sns_t *)&context->ptrActiveScanSns[curChIndex]);
                        }

                        #if (CY_CAPSENSE_SCAN_MODE_INT_DRIVEN == CY_CAPSENSE_SCAN_MODE)
                            ptrCommonCfg->ptrChConfig[curChIndex].ptrHwBase->SNS_CTL = context->ptrInternalContext->snsCtlReg[curChIndex] |
                                    (MSC_SNS_CTL_START_SCAN_Msk | MSC_SNS_CTL_LAST_Msk);
                        #endif

                        #if (CY_CAPSENSE_SCAN_MODE_DMA_DRIVEN == CY_CAPSENSE_SCAN_MODE)
                            context->ptrSensorFrameContext[((lastSlot + 1u +
                                ((curChIndex + ptrCommonCfg->channelOffset) * CY_CAPSENSE_SLOT_COUNT)) *
                                    CY_MSC_6_SNS_REGS) - 1u] |= MSC_SNS_CTL_LAST_Msk;
                        #endif
                    }

                    #if (CY_CAPSENSE_SCAN_MODE_DMA_DRIVEN == CY_CAPSENSE_SCAN_MODE)
                        /* Initiates the frame start for each channel in DMA driven scan mode */
                        for (curChIndex = 0u; curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; curChIndex++)
                        {
                          ptrCommonCfg->ptrChConfig[curChIndex].ptrHwBase->FRAME_CMD =
                              MSC_FRAME_CMD_START_FRAME_Msk;
                        }
                    #endif
                    capStatus = CY_CAPSENSE_STATUS_SUCCESS;
                }
                else
                {
                    #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
                        for (curChIndex = 0u; curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; curChIndex++)
                        {
                            if (CY_CAPSENSE_SNS_CONNECTED == context->ptrActiveScanSns[curChIndex].connectedSnsState)
                            {
                                /* Disconnect the scanned sensor */
                                Cy_CapSense_DisconnectSensor(curChIndex, context);
                            }
                        }
                    #endif /* (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD) */

                    capStatus = Cy_CapSense_SwitchHwConfiguration(CY_CAPSENSE_HW_CONFIG_REGULAR_SCANNING, context);
                    if (CY_CAPSENSE_STATUS_SUCCESS == capStatus)
                    {

                        for (curChIndex = 0u; curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; curChIndex++)
                        {
                            context->ptrActiveScanSns[curChIndex].currentChannelSlotIndex = (uint16_t)startSlotIdLocal;
                        }

                        #if (CY_CAPSENSE_SCAN_MODE_DMA_DRIVEN == CY_CAPSENSE_SCAN_MODE)
                            /* Finds number of empty slots requested for scan within DMA raw array */
                            slotValue = 0u;
                            for (curSlotIndex = 0u; curSlotIndex < startSlotIdLocal; curSlotIndex++)
                            {
                                if (0u == Cy_CapSense_IsSlotEnabled(curSlotIndex, context))
                                {
                                    slotValue++;
                                }
                            }

                            /* Stores DMA raw array ID */
                            ptrIntrCxt->firstValidSlot = (uint16_t)(startSlotIdLocal - slotValue);

                            /* Finds number of valid slots to be scanned */
                            slotValue = 0u;
                            for (curSlotIndex = startSlotIdLocal; curSlotIndex < (lastSlot + 1u); curSlotIndex++)
                            {
                                if (0u != Cy_CapSense_IsSlotEnabled(curSlotIndex, context))
                                {
                                    slotValue++;
                                }
                            }

                            if ((ptrIntrCxt->currentSlotIndex != (uint16_t)startSlotIdLocal) ||
                               (ptrIntrCxt->endSlotIndex != (uint16_t)lastSlot) ||
                               (ptrIntrCxt->numValidSlots != (uint16_t)slotValue))
                            {
                                ptrIntrCxt->numValidSlots = (uint16_t)slotValue;
                                ptrIntrCxt->currentSlotIndex = (uint16_t)startSlotIdLocal;
                                ptrIntrCxt->endSlotIndex = (uint16_t)lastSlot;
                                /* Configure DMA resources for each channel */
                                for (curChIndex = 0u; curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; curChIndex++)
                                {
                                    (void)Cy_CapSense_ConfigureDmaResource(curChIndex, context);
                                }
                            }
                        #else /* (CY_CAPSENSE_SCAN_MODE_INT_DRIVEN == CY_CAPSENSE_SCAN_MODE) */

                            ptrIntrCxt->currentSlotIndex = (uint16_t)startSlotIdLocal;
                            ptrIntrCxt->endSlotIndex = (uint16_t)lastSlot;
                            /* Initiates the frame start for each channel in interrupt driven scan mode */
                            for (curChIndex = 0u; curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; curChIndex++)
                            {
                                ptrCommonCfg->ptrChConfig[curChIndex].ptrHwBase->FRAME_CMD =
                                    MSC_FRAME_CMD_START_FRAME_Msk;
                            }
                        #endif /* (CY_CAPSENSE_SCAN_MODE_DMA_DRIVEN == CY_CAPSENSE_SCAN_MODE) */

                        /* Set the single or multiple slot scan mode */
                        if ((1u == numberSlotsLocal) &&
                            (0u == (context->ptrCommonContext->status & CY_CAPSENSE_MW_STATE_CALIBRATION_MASK)))
                        {
                            ptrIntrCxt->scanSingleSlot = CY_CAPSENSE_SCAN_SNGL_SLOT;
                        }
                        else
                        {
                            ptrIntrCxt->scanSingleSlot = CY_CAPSENSE_SCAN_MULTIPLE_SLOT;
                        }

