zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_v3.c
    return capStatus;
}


#if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN) || \
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN))
/*******************************************************************************
* Function Name: Cy_CapSense_CalibrateAllSlots_V3
****************************************************************************//**
*
* Executes CapDAC auto-calibration for all relevant widgets if enabled.
*
* Having enabled the CDAC auto-calibration algorithm is the most common use
* case. It helps to tune your system considering board-to-board variation,
* temperature drift, etc. CDAC auto-calibration is enabled by default.
*
* The function performs searching of Reference CDAC code, Compensation CDAC
* code Compensation Divider (whichever is enabled) by using a successive
* approximation method to make the sensor's raw count closest to the
* defined targets. The auto-calibration target values are defined
* (by default) as:
* * 85% of the maximum raw count for CSD widgets
* * 40% of the maximum raw count for CSX widgets.
*
* To change calibration targets use the Cy_CapSense_SetCalibrationTarget() function.
*
* For widgets configured with External Cref, the Reference CDAC calibration and
* normalization phases are skipped because the internal CDAC reference
* is not used. Only the Compensation CDAC Divider and Compensation CDAC
* calibration are performed.
*
* \note
* This function is available only for the fifth-generation low power CAPSENSE&trade;.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS          - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_BAD_PARAM        - The input parameter is invalid.
* - CY_CAPSENSE_STATUS_CALIBRATION_FAIL - The calibration is failed due to
*                                         the issues with scanning (either
*                                         watchdog timer, interrupt breaking, etc.).
* - CY_CAPSENSE_STATUS_CALIBRATION_CHECK_FAIL - The calibration is failed
*                                         because of rawcount is out of the
*                                         defined range.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_CalibrateAllSlots_V3(cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t calibStatus = CY_CAPSENSE_STATUS_BAD_PARAM;
    const cy_stc_capsense_common_config_t * ptrCommonCfg;
    uint32_t curWdIndex;

    const cy_stc_capsense_widget_config_t * ptrWdCfg;

    #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CDAC_REF_AUTO_USAGE) || \
         (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CDAC_REF_AUTO_USAGE) || \
         (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CDAC_COMP_USAGE)     || \
         (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CDAC_COMP_USAGE))
        uint32_t curSlotIndex;
    #endif

    if (NULL != context)
    {
        context->ptrCommonContext->status |= CY_CAPSENSE_MW_STATE_CALIBRATION_MASK;

        ptrCommonCfg = context->ptrCommonConfig;

        calibStatus = CY_CAPSENSE_STATUS_SUCCESS;

        #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CDAC_REF_AUTO_USAGE) || \
             (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CDAC_REF_AUTO_USAGE))
            context->ptrCommonContext->status |= CY_CAPSENSE_MW_STATE_CALIBRATION_SINGLE_MASK;
            /* RefCDAC auto-calibration in single CDAC mode */
            for (curSlotIndex = 0u; curSlotIndex < CY_CAPSENSE_SLOT_COUNT; curSlotIndex++)
            {
                calibStatus |= Cy_CapSense_CalibrateSlot(curSlotIndex,
                        CY_CAPSENSE_CAL_MODE_REF_CDAC_SUC_APPR, context);
            }

            /* Finds max RefCDAC and normalizes RefCDAC */
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CDAC_REF_AUTO_USAGE)
                for (curWdIndex = 0u; curWdIndex < ptrCommonCfg->numWd; curWdIndex++)
                {
                    if (CY_CAPSENSE_CSD_GROUP == context->ptrWdConfig[curWdIndex].senseMethod)
                    {
                        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_EXT_CREF_EN)
                            /* Skip normalization for ext Cref widgets - RefCDAC was not calibrated */
                            if (CY_CAPSENSE_CREF_SOURCE_EXTERNAL != context->ptrWdConfig[curWdIndex].cRefSource)
                        #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_EXT_CREF_EN) */
                        {
                            /* Normalize widgets for which CompCDAC */
                            calibStatus |= Cy_CapSense_NormalizeCdac(curWdIndex, context);
                        }
                    }
                }
            #endif
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CDAC_REF_AUTO_USAGE)
                for (curWdIndex = 0u; curWdIndex < ptrCommonCfg->numWd; curWdIndex++)
                {
                    if (CY_CAPSENSE_CSX_GROUP == context->ptrWdConfig[curWdIndex].senseMethod)
                    {
                        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_EXT_CREF_EN)
                            /* Skip normalization for ext Cref widgets - RefCDAC was not calibrated */
                            if (CY_CAPSENSE_CREF_SOURCE_EXTERNAL != context->ptrWdConfig[curWdIndex].cRefSource)
                        #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_EXT_CREF_EN) */
                        {
                            /* Normalize widgets for which CompCDAC */
                            calibStatus |= Cy_CapSense_NormalizeCdac(curWdIndex, context);
                        }
                    }
                }
            #endif
            context->ptrCommonContext->status &= (uint32_t)~((uint32_t)CY_CAPSENSE_MW_STATE_CALIBRATION_SINGLE_MASK);
        #endif

        /* Skip rest of the stages for SmartSense as not needed */
        if (0u == (context->ptrCommonContext->status & CY_CAPSENSE_MW_STATE_SMARTSENSE_MASK))
        {
            #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CDAC_COMP_USAGE) || \
                 (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CDAC_COMP_USAGE))
                    /* Find CompDivider with fixed Ref CDAC and maximum CompCDAC (for case #8 or #4) */
                #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CDAC_COMP_DIV_AUTO_USAGE)
                    for (curWdIndex = 0u; curWdIndex < ptrCommonCfg->numWd; curWdIndex++)
                    {
                        if (CY_CAPSENSE_CSD_GROUP == context->ptrWdConfig[curWdIndex].senseMethod)
                        {
                            calibStatus |= Cy_CapSense_CalibrateCompDivider(curWdIndex, context);
                        }
                    }
                #endif
                #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CDAC_COMP_DIV_AUTO_USAGE)
                    for (curWdIndex = 0u; curWdIndex < ptrCommonCfg->numWd; curWdIndex++)
                    {
                        if (CY_CAPSENSE_CSX_GROUP == context->ptrWdConfig[curWdIndex].senseMethod)
                        {
                            calibStatus |= Cy_CapSense_CalibrateCompDivider(curWdIndex, context);
                        }
                    }
                #endif

                /* Calibrate CompCDAC with fixed Ref CDAC and fixed CompDivider (case #3, #4, #7, #8) */
                if (CY_CAPSENSE_STATUS_SUCCESS == calibStatus)
                {
                    for (curSlotIndex = 0u; curSlotIndex < CY_CAPSENSE_SLOT_COUNT; curSlotIndex++)
                    {
                        /* Calibrate all sensors in slot */
                        calibStatus |= Cy_CapSense_CalibrateSlot(curSlotIndex,
                              CY_CAPSENSE_CAL_MODE_COMP_CDAC_SUC_APPR, context);
                    }
                }
            #endif

