zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_v3.c
            /* Check calibration result */
            if (CY_CAPSENSE_STATUS_SUCCESS == calibStatus)
            {
                for (curWdIndex = 0u; curWdIndex < ptrCommonCfg->numWd; curWdIndex++)
                {
                    ptrWdCfg = &context->ptrWdConfig[curWdIndex];

                    switch (ptrWdCfg->senseMethod)
                    {
                        #if (CY_CAPSENSE_CSD_CDAC_CALIBRATION_USAGE)
                            case CY_CAPSENSE_CSD_GROUP:
                        #endif

                        #if (CY_CAPSENSE_CSX_CDAC_CALIBRATION_USAGE)
                            case CY_CAPSENSE_CSX_GROUP:
                        #endif

                            calibStatus |= Cy_CapSense_VerifyCalibration(curWdIndex, context);
                            break;
                        default:
                            /* Skip widget with disabled auto-calibration */
                            break;
                    }
                }
            }

            /* Update CRC if BIST is enabled */
            #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_BIST_EN) &&\
                 (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_WDGT_CRC_EN))
                Cy_CapSense_UpdateAllWidgetCrc(context);
            #endif
        }

        if (CY_CAPSENSE_STATUS_SUCCESS != calibStatus)
        {
            calibStatus |= CY_CAPSENSE_STATUS_CALIBRATION_FAIL;
        }

        context->ptrCommonContext->status &= ~(uint32_t)CY_CAPSENSE_MW_STATE_CALIBRATION_MASK;
    }

    return calibStatus;
}
#endif


#if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN) || \
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN))
/*******************************************************************************
* Function Name: Cy_CapSense_SetCalibrationTarget_V3
****************************************************************************//**
*
* Sets the CapDAC auto-calibration raw count targets for CSD, CSX and/or ISX
* widgets.
*
* The function sets the specified raw count targets if CSD, CSX and/or ISX widgets
* are in the project and the auto-calibration is enabled for them. These targets
* will be used instead the configured ones by Cy_CapSense_CalibrateAllSlots(),
* Cy_CapSense_CalibrateAllWidgets() and Cy_CapSense_CalibrateWidget() functions.
*
* \note
* This function is available only for the fifth-generation CAPSENSE&trade;.
*
* \param calibrTarget
* The raw counts target in percentage for the specified sensing method.
* It should be more than 0u and less than 100u. If the specified target is outside the
* range, then it will not be updated and the CY_CAPSENSE_STATUS_BAD_PARAM status will be
* returned.
*
* \param snsMethod
* Desired sensing method the calibration target should be updated for:
* * CY_CAPSENSE_CSD_GROUP - CSD sensing method
* * CY_CAPSENSE_CSX_GROUP - CSX sensing method
* * CY_CAPSENSE_ISX_GROUP - ISX sensing method
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS          - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_BAD_PARAM        - At least one of the input parameter is
*                                         invalid.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_SetCalibrationTarget_V3(
                uint32_t calibrTarget,
                uint32_t snsMethod,
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t calibStatus = CY_CAPSENSE_STATUS_BAD_PARAM;

    if (NULL != context)
    {
        if ((CY_CAPSENSE_PERCENTAGE_100 > calibrTarget) && (0u < calibrTarget))
        {
            switch (snsMethod)
            {
                #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
                    case CY_CAPSENSE_CSD_GROUP:
                        context->ptrInternalContext->intrCsdRawTarget = (uint8_t)calibrTarget;
                        break;
                #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) */

                #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
                    case CY_CAPSENSE_CSX_GROUP:
                        context->ptrInternalContext->intrCsxRawTarget = (uint8_t)calibrTarget;
                        break;
                #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) */

                #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN)
                    case CY_CAPSENSE_ISX_GROUP:
                        context->ptrInternalContext->intrIsxRawTarget = (uint8_t)calibrTarget;
                        break;
                #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN) */

                default:
                    /* No action */
                    break;
            }
            calibStatus = CY_CAPSENSE_STATUS_SUCCESS;
        }
    }

    return calibStatus;
}
#endif


#if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN) || \
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN))
/*******************************************************************************
* Function Name: Cy_CapSense_CalibrateAllWidgets_V3
****************************************************************************//**
*
* Calibrates CapDACs for all widgets.
*
* The function is the wrapper for the Cy_CapSense_CalibrateAllSlots() function
* to provide the backward compatibility.
*
* \note
* This function is available only for the fifth-generation CAPSENSE&trade;.
* This function is available in single-channel solution.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS       - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_BAD_PARAM     - The input parameter is invalid.
* - CY_CAPSENSE_STATUS_CALIBRATION_FAIL - The calibration failed if software
*                                         watchdog timeout occurred
*                                         during any calibration scan,
*                                         the scan was not completed, or
*                                         resulted raw counts
*                                         are outside the limits.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_CalibrateAllWidgets_V3(
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t calibStatus = CY_CAPSENSE_STATUS_BAD_PARAM;

    if (NULL != context)
    {
        #if (1u >= CY_CAPSENSE_TOTAL_CH_NUMBER)
            calibStatus = Cy_CapSense_CalibrateAllSlots(context);
        #endif /* (1u >= CY_CAPSENSE_TOTAL_CH_NUMBER) */
    }

    return calibStatus;
}
#endif


#if ((1u == CY_CAPSENSE_TOTAL_CH_NUMBER) && \
     ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN) || \
      (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN)))
/*******************************************************************************
* Function Name: Cy_CapSense_CalibrateWidget_V3
****************************************************************************//**
*
* Executes the CapDAC calibration for all the sensors in the specified widget
* to the default target value.
*
* This function performs exactly the same tasks as
* Cy_CapSense_CalibrateAllWidgets(), but only for a specified widget.
*
* For widgets configured with External Cref, the Reference CDAC calibration phase is
* skipped. Only the Compensation CDAC Divider and Compensation CDAC calibration are
* performed.
*
* \note
* This function is available only for the fifth-generation CAPSENSE&trade;.
* This function is available in single-channel solution.
*
* \param widgetId
* Specifies the ID number of the widget. A macro for the widget ID can be found
* in the cycfg_capsense.h file defined as CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS   - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_BAD_PARAM - The input parameter is invalid.
* - CY_CAPSENSE_STATUS_CALIBRATION_FAIL - The calibration is failed due to
*                                  the issues with scanning (either
*                                  watchdog timer, interrupt breaking, etc.).
* - CY_CAPSENSE_STATUS_CALIBRATION_CHECK_FAIL - The calibration is failed
*                                  because of rawcount is out of the
*                                  defined range.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_CalibrateWidget_V3(
                uint32_t widgetId,
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t calibrationStatus = CY_CAPSENSE_STATUS_SUCCESS;
    cy_stc_capsense_widget_config_t const * ptrWdCfg;
    uint32_t curSlotIndex;

    if (NULL != context)
    {
        context->ptrCommonContext->status |= CY_CAPSENSE_MW_STATE_CALIBRATION_MASK;

        if (widgetId < context->ptrCommonConfig->numWd)
        {
            ptrWdCfg = &context->ptrWdConfig[widgetId];

            switch (ptrWdCfg->senseMethod)
            {
                #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) && (0u != CY_CAPSENSE_CSD_CALIBRATION_EN))
                    case CY_CAPSENSE_CSD_GROUP:

                        /* Calibrate RefCDAC with disabled CompCDAC */
                        #if (0u != CY_CAPSENSE_CSD_CDAC_REF_AUTO_USAGE)
                            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_EXT_CREF_EN)
                            /* Skip RefCDAC calibration for ext Cref widgets */
                            if (CY_CAPSENSE_CREF_SOURCE_EXTERNAL != ptrWdCfg->cRefSource)
                            #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_EXT_CREF_EN) */
                            {
                                context->ptrCommonContext->status |= CY_CAPSENSE_MW_STATE_CALIBRATION_SINGLE_MASK;
                                for (curSlotIndex = ptrWdCfg->firstSlotId;
                                     curSlotIndex < ((uint32_t)ptrWdCfg->firstSlotId + ptrWdCfg->numSlots); curSlotIndex++)
                                {
                                    calibrationStatus |= Cy_CapSense_CalibrateSlot(curSlotIndex, CY_CAPSENSE_CAL_MODE_REF_CDAC_SUC_APPR, context);
                                }
                                calibrationStatus |= Cy_CapSense_NormalizeCdac(widgetId, context);
                                context->ptrCommonContext->status &= (uint32_t)~((uint32_t)CY_CAPSENSE_MW_STATE_CALIBRATION_SINGLE_MASK);
                            }
                        #endif

