zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_v3.c
                        /* Find CompDivider with fixed Ref CDAC and maximum CompCDAC (for case #8 or #4) */
                        #if (0u != CY_CAPSENSE_CSD_CDAC_COMP_DIV_AUTO_USAGE)
                            calibrationStatus |= Cy_CapSense_CalibrateCompDivider(widgetId, context);
                        #endif

                        /* Calibrate CompCDAC with fixed Ref CDAC and fixed CompDivider (case #3 and #7) */
                        #if (0u != CY_CAPSENSE_CSD_CDAC_COMP_USAGE)
                            for (curSlotIndex = ptrWdCfg->firstSlotId;
                                 curSlotIndex < ((uint32_t)ptrWdCfg->firstSlotId + ptrWdCfg->numSlots); curSlotIndex++)
                            {
                                /* Calibrate all sensors in slot */
                                calibrationStatus |= Cy_CapSense_CalibrateSlot(curSlotIndex, CY_CAPSENSE_CAL_MODE_COMP_CDAC_SUC_APPR, context);
                            }
                        #endif

                        break;

                #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) */

                #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) && (0u != CY_CAPSENSE_CSX_CALIBRATION_EN))
                    case CY_CAPSENSE_CSX_GROUP:

                        /* Calibrate RefCDAC with disabled CompCDAC */
                        #if (0u != CY_CAPSENSE_CSX_CDAC_REF_AUTO_USAGE)
                            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_EXT_CREF_EN)
                            /* Skip RefCDAC calibration for ext Cref widgets */
                            if (CY_CAPSENSE_CREF_SOURCE_EXTERNAL != ptrWdCfg->cRefSource)
                            #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_EXT_CREF_EN) */
                            {
                                context->ptrCommonContext->status |= CY_CAPSENSE_MW_STATE_CALIBRATION_SINGLE_MASK;
                                for (curSlotIndex = ptrWdCfg->firstSlotId;
                                     curSlotIndex < ((uint32_t)ptrWdCfg->firstSlotId + ptrWdCfg->numSlots); curSlotIndex++)
                                {
                                    calibrationStatus |= Cy_CapSense_CalibrateSlot(curSlotIndex, CY_CAPSENSE_CAL_MODE_REF_CDAC_SUC_APPR, context);
                                }
                                calibrationStatus |= Cy_CapSense_NormalizeCdac(widgetId, context);
                                context->ptrCommonContext->status &= (uint32_t)~((uint32_t)CY_CAPSENSE_MW_STATE_CALIBRATION_SINGLE_MASK);
                            }
                        #endif

                        /* Find CompDivider with fixed Ref CDAC and maximum CompCDAC (for case #8 or #4) */
                        #if (0u != CY_CAPSENSE_CSX_CDAC_COMP_DIV_AUTO_USAGE)
                            calibrationStatus |= Cy_CapSense_CalibrateCompDivider(widgetId, context);
                        #endif

                        /* Calibrate CompCDAC with fixed Ref CDAC and fixed CompDivider (case #3 and #7) */
                        #if (0u != CY_CAPSENSE_CSX_CDAC_COMP_USAGE)
                            for (curSlotIndex = ptrWdCfg->firstSlotId;
                                 curSlotIndex < ((uint32_t)ptrWdCfg->firstSlotId + ptrWdCfg->numSlots); curSlotIndex++)
                            {
                                /* Calibrate all sensors in slot */
                                calibrationStatus |= Cy_CapSense_CalibrateSlot(curSlotIndex, CY_CAPSENSE_CAL_MODE_COMP_CDAC_SUC_APPR, context);
                            }
                        #endif

                        break;

                #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) */

                default:
                    calibrationStatus = CY_CAPSENSE_STATUS_BAD_PARAM;
                    break;
            }


            /* Check calibration result */
            calibrationStatus |= Cy_CapSense_VerifyCalibration(widgetId, context);

            /* Update CRC if BIST is enabled */
            #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_BIST_EN) &&\
                 (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_WDGT_CRC_EN))
                Cy_CapSense_UpdateCrcWidget(widgetId, context);
            #endif
        }

        if (CY_CAPSENSE_STATUS_SUCCESS != calibrationStatus)
        {
            calibrationStatus |= CY_CAPSENSE_STATUS_CALIBRATION_FAIL;
        }

        context->ptrCommonContext->status &= ~(uint32_t)CY_CAPSENSE_MW_STATE_CALIBRATION_MASK;
    }

    return calibrationStatus;
}
#endif


/*******************************************************************************
* Function Name: Cy_CapSense_WatchdogCyclesNum
****************************************************************************//**
*
* Converts the specified time into number of CPU cycles.
*
* \param desiredTimeUs
* The time (delay) specified in us.
*
* \param cpuFreqMHz
* The CPU frequency in MHz.
*
* \param cyclesPerLoop
* The number of cycles per a loop.
*
*******************************************************************************/
uint32_t Cy_CapSense_WatchdogCyclesNum(
                uint32_t desiredTimeUs,
                uint32_t cpuFreqMHz,
                uint32_t cyclesPerLoop)
{
    uint32_t retVal;

    if (0uL != cyclesPerLoop)
    {
        retVal = (desiredTimeUs * cpuFreqMHz) / cyclesPerLoop;
    }
    else
    {
        retVal = 0xFFFFFFFFuL;
    }

    return retVal;
}


/*******************************************************************************
* Function Name: Cy_CapSense_SsInitialize
****************************************************************************//**
*
* Performs the hardware and firmware initialization required for proper operation
* of the CAPSENSE&trade; middleware. This function is called from
* the Cy_CapSense_Init() prior to calling any other function of the middleware.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return status
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS       - The operation is performed successfully.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_SsInitialize(cy_stc_capsense_context_t * context)
{
    uint32_t curChIndex;
    cy_capsense_status_t capStatus = CY_CAPSENSE_STATUS_SUCCESS;
    const cy_stc_capsense_common_config_t * ptrCommonCfg = context->ptrCommonConfig;
    uint32_t i;

    (void)ptrCommonCfg;
    capStatus |= Cy_CapSense_InitializeSourceSenseClk(context);

