zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_v3.c
/*******************************************************************************
* Function Name: Cy_CapSense_CsdDisconnectSns
****************************************************************************//**
*
* Disconnects a CSD sensor from the specified channel MSC HW block.
*
* The function disconnects all the sensor pins including ganged.
* The sensor and the current slot are specified in the cy_stc_capsense_active_scan_sns_t structure.
*
* \param chIndex
* The desired channel index.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_CsdDisconnectSns(
                uint32_t chIndex,
                const cy_stc_capsense_context_t * context)
{
    const cy_stc_capsense_electrode_config_t * eltdPinCfg =
                          context->ptrActiveScanSns[chIndex].ptrEltdConfig;
    const cy_stc_capsense_pin_config_t * ptrActivePin = eltdPinCfg->ptrPin;

    uint32_t i;

    if ((chIndex + context->ptrCommonConfig->channelOffset) == eltdPinCfg->chId)
    {
        /* Disconnect all pins of the current sensor */
        for (i = 0u; i < eltdPinCfg->numPins; i++)
        {
            Cy_CapSense_SsConfigPinRegisters(ptrActivePin->pcPtr, (uint32_t)ptrActivePin->pinNumber,
                                             context->ptrInternalContext->csdInactiveSnsDm,
                                             context->ptrInternalContext->csdInactiveSnsHsiom);
            Cy_GPIO_Clr(ptrActivePin->pcPtr, (uint32_t)ptrActivePin->pinNumber);
            ptrActivePin++;
        }
    }
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) */


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_CsxConnectTx
****************************************************************************//**
*
* Connects a CSX sensor Tx electrode to the specified channel MSC HW block.
*
* The function connects all the Tx electrode pins including ganged.
* The electrode and the current slot are specified in the cy_stc_capsense_active_scan_sns_t structure.
*
* \param chIndex
* The desired channel index.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_CsxConnectTx(
                uint32_t chIndex,
                const cy_stc_capsense_context_t * context)
{
    uint32_t pinIndex;
    en_hsiom_sel_t hsiomState = CY_CAPSENSE_HSIOM_SEL_CSD_SENSE;
    const cy_stc_capsense_electrode_config_t * ptrEltd;
    const cy_stc_capsense_active_scan_sns_t * ptrActive = &context->ptrActiveScanSns[chIndex];
    const cy_stc_capsense_pin_config_t * pinPointer;

    #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_MULTI_PHASE_TX_ENABLED)
        uint32_t i;
        uint32_t pattern;
        uint32_t eltdMptxOrder;
        cy_stc_capsense_widget_config_t const * ptrWdCfg = &context->ptrWdConfig[ptrActive->widgetIndex];
        uint32_t mptxOrd = ptrWdCfg->mpOrder;
    #endif

    #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_MULTI_PHASE_TX_ENABLED)
        if (CY_CAPSENSE_MPTX_MIN_ORDER > mptxOrd)
        {
            ptrEltd = ptrActive->ptrTxConfig;
            if ((chIndex + context->ptrCommonConfig->channelOffset) == ptrEltd->chId)
            {
                pinPointer = ptrActive->ptrTxConfig->ptrPin;
                for (pinIndex = ptrEltd->numPins; pinIndex-- > 0u;)
                {
                    Cy_CapSense_SsConfigPinRegisters(pinPointer->pcPtr, (uint32_t)pinPointer->pinNumber,
                            CY_CAPSENSE_DM_GPIO_STRONG_IN_OFF, hsiomState);
                    pinPointer++;
                }
            }
        }
        else
        {
            /* Finds the index of the first TX electrode in the mptx group */
            eltdMptxOrder = ptrActive->sensorIndex % mptxOrd;
            i = ptrActive->sensorIndex - eltdMptxOrder;
            i = ptrWdCfg->numCols + (i % ptrWdCfg->numRows);
            ptrEltd = &ptrWdCfg->ptrEltdConfig[i];

            /* Finding the right vector / pattern for mptx operation */
            pattern = ptrWdCfg->ptrMpTable->vector;
            if (0u != eltdMptxOrder)
            {
                pattern = (pattern >> eltdMptxOrder) | (pattern << (mptxOrd - eltdMptxOrder));
            }

            if (CY_CAPSENSE_MPTX_MAX_ORDER > mptxOrd)
            {
                pattern &= (0x01uL << mptxOrd) - 1u;
            }

            /* Loop through all involved mptx TX electrodes, positive and negative */
            for (i = 0u; i < mptxOrd; i++)
            {
                if ((chIndex + context->ptrCommonConfig->channelOffset) == ptrEltd->chId)
                {
                    hsiomState = CY_CAPSENSE_HSIOM_SEL_CSD_SENSE;
                    if (0u == (pattern & 0x01u))
                    {
                        hsiomState = CY_CAPSENSE_HSIOM_SEL_CSD_SHIELD;
                    }
                    pinPointer = ptrEltd->ptrPin;
                    /* Loop through all pads for this electrode (ganged sensor) */
                    for (pinIndex = ptrEltd->numPins; pinIndex-- > 0u;)
                    {
                        Cy_CapSense_SsConfigPinRegisters(pinPointer->pcPtr, (uint32_t)pinPointer->pinNumber,
                                CY_CAPSENSE_DM_GPIO_STRONG_IN_OFF, hsiomState);
                        pinPointer++;
                    }
                }
                pattern >>= 0x01u;
                ptrEltd++;
            }
        }
    #else
        ptrEltd = ptrActive->ptrTxConfig;
        if ((chIndex + context->ptrCommonConfig->channelOffset) == ptrEltd->chId)
        {
            pinPointer = ptrActive->ptrTxConfig->ptrPin;
            for (pinIndex = ptrEltd->numPins; pinIndex-- > 0u;)
            {
                Cy_CapSense_SsConfigPinRegisters(pinPointer->pcPtr, (uint32_t)pinPointer->pinNumber,
                        CY_CAPSENSE_DM_GPIO_STRONG_IN_OFF, hsiomState);
                pinPointer++;
            }
        }
    #endif
}


