zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_v3.c
    if ((chIndex + context->ptrCommonConfig->channelOffset) == context->ptrActiveScanSns[chIndex].ptrRxConfig->chId)
    {
        for (pinIndex = context->ptrActiveScanSns[chIndex].ptrRxConfig->numPins;
             pinIndex-- > 0u;)
        {
            Cy_CapSense_SsConfigPinRegisters(pinPointer->pcPtr, (uint32_t)pinPointer->pinNumber,
                                             context->ptrInternalContext->csxInactiveSnsDm,
                                             context->ptrInternalContext->csxInactiveSnsHsiom);
            Cy_GPIO_Clr(pinPointer->pcPtr, (uint32_t)pinPointer->pinNumber);
            pinPointer++;
        }
    }
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) */
#endif /* (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD) */


/*******************************************************************************
* Function Name: Cy_CapSense_ScanISR
****************************************************************************//**
*
* This is an internal ISR function to handle the MSC sensing method operation.
*
* \param capsenseContext
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_ScanISR(void * capsenseContext)
{
    uint32_t intrMask;
    uint32_t i;
    MSC_Type * ptrMscHwBase;

    #if (CY_CAPSENSE_SCAN_MODE_INT_DRIVEN == CY_CAPSENSE_SCAN_MODE)
        uint32_t tmpRawCount;
        uint32_t slotValue;
        uint32_t wdIndex;

        #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
            uint32_t prevWdIndex;
        #else
            uint32_t * ptrSensorFrame;
        #endif
    #endif

    cy_stc_capsense_context_t * cxt = (cy_stc_capsense_context_t *)capsenseContext;
    const cy_stc_capsense_common_config_t * ptrCommonCfg = cxt->ptrCommonConfig;

    #if (CY_CAPSENSE_SCAN_MODE_INT_DRIVEN == CY_CAPSENSE_SCAN_MODE)
        uint32_t scanSlotIndexValid;
        cy_stc_capsense_active_scan_sns_t * ptrActive;
        cy_stc_capsense_internal_context_t * ptrIntrCxt = cxt->ptrInternalContext;
        uint32_t slotStcIndex;
    #endif /* (CY_CAPSENSE_SCAN_MODE_INT_DRIVEN == CY_CAPSENSE_SCAN_MODE) */
    uint32_t curChIndex = (uint32_t)ptrCommonCfg->channelOffset + CY_CAPSENSE_TOTAL_CH_NUMBER;

    /* Define the interrupt scope */
    #if (CY_CAPSENSE_SCAN_MODE_DMA_DRIVEN == CY_CAPSENSE_SCAN_MODE)
        intrMask = MSC_INTR_MASK_FRAME_Msk;
    #else
        intrMask = MSC_INTR_MASK_SCAN_Msk;
    #endif /* (CY_CAPSENSE_SCAN_MODE_DMA_DRIVEN == CY_CAPSENSE_SCAN_MODE) */

    /* Check which channel have fired the interrupt */
    for (i = 0u; i < CY_CAPSENSE_TOTAL_CH_NUMBER; i++)
    {
        if (0u != (ptrCommonCfg->ptrChConfig[i].ptrHwBase->INTR & intrMask))
        {
            curChIndex = i;
            break;
        }
    }

    ptrMscHwBase = ptrCommonCfg->ptrChConfig[curChIndex].ptrHwBase;

    if (curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER)
    {
        /* Clear all pending interrupts of the MSC HW block */
        ptrMscHwBase->INTR = CY_CAPSENSE_MSC_INTR_ALL_MSK;
        (void)ptrMscHwBase->INTR;

        #if (CY_CAPSENSE_SCAN_MODE_INT_DRIVEN == CY_CAPSENSE_SCAN_MODE)
            slotStcIndex = ((curChIndex + ptrCommonCfg->channelOffset) * CY_CAPSENSE_SLOT_COUNT) + ptrIntrCxt->currentSlotIndex;
            /* Set the active scan pointer to the current channel */
            ptrActive = &(cxt->ptrActiveScanSns[curChIndex]);

            slotValue = cxt->ptrScanSlots[slotStcIndex].wdId;
            /* Skips raw count update for empty slots or disabled/non-working widgets */
            if ((CY_CAPSENSE_SLOT_SHIELD_ONLY > slotValue) && (0u != Cy_CapSense_IsWidgetEnabled(slotValue, cxt)))
            {
                /* Read raw counts */
                tmpRawCount = ptrMscHwBase->RESULT_FIFO_RD;
                ptrActive->ptrSnsContext->status &= (uint8_t)~CY_CAPSENSE_SNS_OVERFLOW_MASK;
                if (MSC_RESULT_FIFO_RD_OVERFLOW_Msk == (tmpRawCount & MSC_RESULT_FIFO_RD_OVERFLOW_Msk))
                {
                    ptrActive->ptrSnsContext->status |= CY_CAPSENSE_SNS_OVERFLOW_MASK;
                }
                tmpRawCount &= MSC_RESULT_FIFO_RD_RAW_COUNT_Msk;
                ptrActive->ptrSnsContext->raw = (uint16_t)tmpRawCount;
            }
            else
            {
                (void)ptrMscHwBase->RESULT_FIFO_RD;
            }

            /* Stores non-retention SNS_CTL register value for LFT mode */
            cxt->ptrInternalContext->snsCtlReg[curChIndex] = ptrMscHwBase->SNS_CTL;

            #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
                if ((CY_CAPSENSE_SCAN_MULTIPLE_SLOT == cxt->ptrInternalContext->scanSingleSlot) &&
                    (CY_CAPSENSE_SLOT_SHIELD_ONLY != slotValue) &&
                    (CY_CAPSENSE_SLOT_EMPTY != slotValue))
                {
                    /* Disconnect the scanned sensor */
                    Cy_CapSense_DisconnectSensor(curChIndex, cxt);
                }
            #endif

            /* Find the next enabled slot for scanning */
            ptrActive->currentChannelSlotIndex = ptrIntrCxt->currentSlotIndex;
            while (ptrActive->currentChannelSlotIndex != ptrIntrCxt->endSlotIndex)
            {
                if (0u != Cy_CapSense_IsSlotEnabled((uint32_t)ptrActive->currentChannelSlotIndex + 1u, cxt))
                {
                    break;
                }
                /* Update active sensor structure */
                ptrActive->currentChannelSlotIndex++;
                slotStcIndex++;
            }

            /* Check for the last slot with multiple slot scan, if not - start the next slot scan */
            if (ptrActive->currentChannelSlotIndex != ptrIntrCxt->endSlotIndex)
            {
                /* Update active sensor structure */
                ptrActive->currentChannelSlotIndex++;
                slotStcIndex++;
                slotValue = cxt->ptrScanSlots[slotStcIndex].wdId;

