zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_v3.c
                scanSlotIndexValid = slotStcIndex;
                if (CY_CAPSENSE_SLOT_EMPTY == slotValue)
                {
                    #if (CY_CAPSENSE_TOTAL_CH_NUMBER > 1u)
                        if (slotStcIndex < CY_CAPSENSE_SLOT_COUNT)
                        {
                            scanSlotIndexValid += CY_CAPSENSE_SLOT_COUNT;
                        }
                        else
                        {
                            scanSlotIndexValid -= CY_CAPSENSE_SLOT_COUNT;
                        }
                    #endif /* (CY_CAPSENSE_TOTAL_CH_NUMBER > 1u) */
                }
                else if (CY_CAPSENSE_SLOT_SHIELD_ONLY <= slotValue)
                {
                    scanSlotIndexValid = ((uint32_t)cxt->ptrScanSlots[slotStcIndex].snsId * CY_CAPSENSE_SLOT_COUNT) +
                                (slotStcIndex % CY_CAPSENSE_SLOT_COUNT);
                }
                else
                {
                    /* Do nothing */
                }

                /* Initialize next slot scan for the current channel */
                wdIndex = cxt->ptrScanSlots[scanSlotIndexValid].wdId;
                #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
                    prevWdIndex = ptrActive->widgetIndex;
                    Cy_CapSense_ConfigureAnalogMuxResource(curChIndex, cxt->ptrWdConfig[wdIndex].senseMethod, cxt);
                #endif
                Cy_CapSense_InitActivePtr(curChIndex, wdIndex,
                            cxt->ptrScanSlots[scanSlotIndexValid].snsId, cxt);

                #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
                    if ((slotValue != CY_CAPSENSE_SLOT_EMPTY) &&
                       (slotValue != CY_CAPSENSE_SLOT_SHIELD_ONLY))
                    {
                        /* Connect the widget first sensor electrodes */
                        Cy_CapSense_ConnectSensor(curChIndex, cxt);
                    }

                    /* Getting the sensor frame configuration */
                    Cy_CapSense_AmuxUpdateScanConfig(curChIndex, slotStcIndex, prevWdIndex, cxt);
                #else
                    ptrSensorFrame = &cxt->ptrSensorFrameContext[(((curChIndex * CY_CAPSENSE_SLOT_COUNT) +
                            ptrActive->currentChannelSlotIndex) * CY_MSC_6_SNS_REGS)];
                #endif

                #if (1u == CY_CAPSENSE_TOTAL_CH_NUMBER)
                    ptrIntrCxt->currentSlotIndex++;
                #else
                    for (i = 1u; i < CY_CAPSENSE_TOTAL_CH_NUMBER; i++)
                    {
                        if (cxt->ptrActiveScanSns[0u].currentChannelSlotIndex != cxt->ptrActiveScanSns[i].currentChannelSlotIndex)
                        {
                            break;
                        }
                        ptrIntrCxt->currentSlotIndex = cxt->ptrActiveScanSns[0u].currentChannelSlotIndex;
                    }
                #endif /* (1u == CY_CAPSENSE_TOTAL_CH_NUMBER) */

                if (NULL != ptrIntrCxt->ptrSSCallback)
                {
                    ptrIntrCxt->ptrSSCallback((cy_stc_capsense_active_scan_sns_t *)&cxt->ptrActiveScanSns[curChIndex]);
                }

                /* Start the next scan for the current channel */
                #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
                    Cy_CapSense_AmuxStartScan(ptrMscHwBase);
                #else
                    Cy_MSC_ConfigureScan(ptrMscHwBase, CY_MSC_6_SNS_REGS, ptrSensorFrame);
                #endif
            }
            else
            {
                Cy_CapSense_ClrBusyFlags(curChIndex, cxt);
            }
        #else /* (CY_CAPSENSE_SCAN_MODE_DMA_DRIVEN == CY_CAPSENSE_SCAN_MODE) */
            /* The WHOLE FRAME scan is finished for the current channel */
            Cy_CapSense_ClrBusyFlags(curChIndex, cxt);
        #endif
    }
}


#if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
#if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CDAC_COMP_USAGE) ||\
    (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CDAC_COMP_USAGE))
/*******************************************************************************
* Function Name: Cy_CapSense_AmuxUpdateCdacComp
****************************************************************************//**
*
* Updates the Compensation CDAC with the configuration of the specified sensor.
*
* \param base
* Pointer to a MSC HW block base address.
*
* \param ptrSnsContext
* Specifies the pointer to a sensor context structure.
*
*******************************************************************************/
void Cy_CapSense_AmuxUpdateCdacComp(
                MSC_Type * base,
                const cy_stc_capsense_sensor_context_t * ptrSnsContext)
{
    uint32_t tmpRegVal;

    tmpRegVal = base->SNS_CDAC_CTL;
    tmpRegVal &= ~MSC_SNS_CDAC_CTL_SEL_CO_Msk;
    tmpRegVal |= ((uint32_t)ptrSnsContext->cdacComp) << MSC_SNS_CDAC_CTL_SEL_CO_Pos;
    base->SNS_CDAC_CTL = tmpRegVal;
}
#endif


/*******************************************************************************
* Function Name: Cy_CapSense_AmuxUpdateScanConfig
****************************************************************************//**
*
* Updates the MSC HW block with the configuration of the specified scan slot.
*
* \param chIndex
* The desired channel index.
*
* \param scanSlot
* Specifies the ID number of the slot.
*
* \param prevWdIndex
* Specifies the ID number of the widget scanned in scope of previous scan.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_AmuxUpdateScanConfig(
                uint32_t chIndex,
                uint32_t scanSlot,
                uint32_t prevWdIndex,
                cy_stc_capsense_context_t * context)
{
    uint32_t isSnsRow = 0u;
    MSC_Type * ptrMscHwBase = context->ptrCommonConfig->ptrChConfig[chIndex].ptrHwBase;
    cy_stc_capsense_active_scan_sns_t * ptrActive = &context->ptrActiveScanSns[chIndex];
    uint32_t sensorFrame[CY_MSC_6_SNS_REGS] = {0u, 0u, 0u, 0u, 0u, 0u};

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
        if ((CY_CAPSENSE_CSD_GROUP == ptrActive->currentSenseMethod) &&
           (context->ptrWdConfig[ptrActive->widgetIndex].numCols <= ptrActive->sensorIndex))
        {
            isSnsRow = 1u;
        }
    #endif

    if ((prevWdIndex != ptrActive->widgetIndex) || (0u != isSnsRow))
    {
        (void)Cy_CapSense_GenerateSensorConfig(chIndex, scanSlot, &sensorFrame[0u], context);

        sensorFrame[CY_CAPSENSE_SNS_CTL_INDEX] &= ~MSC_SNS_CTL_START_SCAN_Msk;
        /* Configure the last slot */
        if (context->ptrInternalContext->endSlotIndex == ptrActive->currentChannelSlotIndex)
        {
            sensorFrame[CY_CAPSENSE_SNS_CTL_INDEX] |= MSC_SNS_CTL_LAST_Msk;
        }

