zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_v3.c
    }

    return capStatus;
}
#endif /* (CY_CAPSENSE_SCAN_MODE_DMA_DRIVEN == CY_CAPSENSE_SCAN_MODE) */

#if (CY_CAPSENSE_SCAN_MODE_DMA_DRIVEN == CY_CAPSENSE_SCAN_MODE)
/*******************************************************************************
* Function Name: Cy_CapSense_ConfigureDmaResource
****************************************************************************//**
*
* Configures DMAC channels prior to the scan.
*
* \param mscChIndex
* Index of the MSC channel to configure.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of operation.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_ConfigureDmaResource(
                uint32_t mscChIndex,
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t capStatus = CY_CAPSENSE_STATUS_SUCCESS;
    const cy_stc_capsense_channel_config_t * ptrCurMscChCfg = &(context->ptrCommonConfig->ptrChConfig[mscChIndex]);
    DMAC_Type * dmacBase = context->ptrCommonConfig->ptrDmacBase;
    uint8_t chainWrChIndex = ptrCurMscChCfg->dmaChainWrChIndex;
    uint8_t chainRdChIndex = ptrCurMscChCfg->dmaChainRdChIndex;
    uint32_t currentSlotIndex = context->ptrInternalContext->currentSlotIndex;
    uint32_t endSlotIndex = context->ptrInternalContext->endSlotIndex;
    uint32_t currSlotPos = (mscChIndex + context->ptrCommonConfig->channelOffset) * CY_CAPSENSE_SLOT_COUNT;

    /* Disable DMAC channels before configuring */
    Cy_DMAC_Channel_Disable(dmacBase, chainRdChIndex);

    /* Configure the destination and data count for the Chain Write channel of DMAC */
    Cy_DMAC_Descriptor_SetSrcAddress(dmacBase, chainWrChIndex, CY_DMAC_DESCRIPTOR_PING, &context->ptrCommonConfig->ptrDmaWrChSnsCfgAddrLocal[currSlotPos + currentSlotIndex]);
    Cy_DMAC_Descriptor_SetDataCount(dmacBase, chainWrChIndex, CY_DMAC_DESCRIPTOR_PING, (endSlotIndex - currentSlotIndex + 1u));

    /* Configure the destination and data count for the Chain Read channel of DMAC */
    Cy_DMAC_Descriptor_SetSrcAddress(dmacBase, chainRdChIndex, CY_DMAC_DESCRIPTOR_PING, &context->ptrCommonConfig->ptrDmaRdChSnsCfgAddrLocal[currSlotPos + context->ptrInternalContext->firstValidSlot]);
    Cy_DMAC_Descriptor_SetDataCount(dmacBase, chainRdChIndex, CY_DMAC_DESCRIPTOR_PING, context->ptrInternalContext->numValidSlots);

    /* Enable DMAC channels to perform scanning */
    Cy_DMAC_Channel_Enable(dmacBase, chainRdChIndex);

    return capStatus;
}
#endif /* (CY_CAPSENSE_SCAN_MODE_DMA_DRIVEN == CY_CAPSENSE_SCAN_MODE) */


#if (CY_CAPSENSE_SCAN_MODE_DMA_DRIVEN == CY_CAPSENSE_SCAN_MODE)
/*******************************************************************************
* Function Name: Cy_CapSense_InitializeDmaArrays
****************************************************************************//**
*
* Initializes DMA arrays used for scanning.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of operation.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_InitializeDmaArrays(
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t capStatus = CY_CAPSENSE_STATUS_SUCCESS;
    uint32_t slotIndex;
    const cy_stc_capsense_common_config_t * ptrCommonCfg = context->ptrCommonConfig;

    for (slotIndex = 0u; slotIndex < (CY_CAPSENSE_SLOT_COUNT * CY_CAPSENSE_TOTAL_CH_NUMBER); slotIndex++)
    {
        ptrCommonCfg->ptrDmaWrChSnsCfgAddrLocal[slotIndex] = ptrCommonCfg->ptrDmaWrChSnsCfgAddr[slotIndex];
        ptrCommonCfg->ptrDmaRdChSnsCfgAddrLocal[slotIndex] = ptrCommonCfg->ptrDmaRdChSnsCfgAddr[slotIndex];
    }

    context->ptrInternalContext->numValidSlots = CY_CAPSENSE_SLOT_COUNT_MAX_VALUE;

    return capStatus;
}
#endif /* (CY_CAPSENSE_SCAN_MODE_DMA_DRIVEN == CY_CAPSENSE_SCAN_MODE) */


#if (CY_CAPSENSE_SCAN_MODE_DMA_DRIVEN == CY_CAPSENSE_SCAN_MODE)
/*******************************************************************************
* Function Name: Cy_CapSense_ConfigureDmaArrays
****************************************************************************//**
*
* Configures DMA arrays used for scanning considering widget enable/disable
* and working/non-working statuses.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of operation.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_ConfigureDmaArrays(
                cy_stc_capsense_context_t * context)
{
    uint32_t chIndex;
    uint32_t slotOffset;
    uint32_t slotIndex;
    uint32_t slotStatus;
    uint32_t wdIndex;
    uint32_t rawPtrIndex = 0u;
    cy_capsense_status_t capStatus = CY_CAPSENSE_STATUS_SUCCESS;
    const cy_stc_capsense_common_config_t * ptrCommonCfg = context->ptrCommonConfig;
    cy_stc_capsense_internal_context_t * ptrIntrCxt = context->ptrInternalContext;
    uint32_t * ptrSnsFrmCxt = &context->ptrSensorFrameContext[CY_CAPSENSE_SNS_CTL_INDEX];

    ptrIntrCxt->numValidSlots = CY_CAPSENSE_SLOT_COUNT_MAX_VALUE;

    /* Loops across all slots within one enabled channel */
    for (slotIndex = 0u; slotIndex < CY_CAPSENSE_SLOT_COUNT; slotIndex++)
    {
        /* Gets status of a slot considering all channels */
        slotStatus = Cy_CapSense_IsSlotEnabled(slotIndex, context);
        /* Loops across all configured channels */
        for (chIndex = 0u; chIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; chIndex++)
        {
            slotOffset = chIndex * (CY_CAPSENSE_SLOT_COUNT * CY_MSC_6_SNS_REGS);
            /* Disable sensor */
            ptrSnsFrmCxt[slotOffset] &= (uint32_t)~MSC_SNS_CTL_VALID_Msk;
            /* Mark sensors valid and store pointer to rawcount address */
            if (0u != slotStatus)
            {
                ptrSnsFrmCxt[slotOffset] |= MSC_SNS_CTL_VALID_Msk;
                wdIndex = context->ptrScanSlots[(chIndex * CY_CAPSENSE_SLOT_COUNT) + slotIndex].wdId;
                if (0u != Cy_CapSense_IsWidgetEnabled(wdIndex, context))
                {
                    ptrCommonCfg->ptrDmaRdChSnsCfgAddrLocal[(chIndex * CY_CAPSENSE_SLOT_COUNT) + rawPtrIndex] =
                            ptrCommonCfg->ptrDmaRdChSnsCfgAddr[(chIndex * CY_CAPSENSE_SLOT_COUNT) + slotIndex];
                }
                else
                {
                    ptrCommonCfg->ptrDmaRdChSnsCfgAddrLocal[(chIndex * CY_CAPSENSE_SLOT_COUNT) + rawPtrIndex] =
                            ptrCommonCfg->ptrEmptyRawCount;
                }
            }
        }
        if (0u != slotStatus)
        {
            rawPtrIndex++;
        }
        ptrSnsFrmCxt = &ptrSnsFrmCxt[CY_MSC_6_SNS_REGS];
    }

