zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_v3.c
    return capStatus;
}
#endif /* (CY_CAPSENSE_SCAN_MODE_DMA_DRIVEN == CY_CAPSENSE_SCAN_MODE) */


/*******************************************************************************
* Function Name: Cy_CapSense_SetModClkDivider
****************************************************************************//**
*
* Sets the modulator clock and then starts it.
*
* Do not call this function directly from the application program.
*
* \param dividerValue
* The MOD_CLK divider to be set for the PERI clock.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_SetModClkDivider(
                uint32_t dividerValue,
                const cy_stc_capsense_context_t * context)
{
    uint32_t dividerIndex = (uint32_t)context->ptrCommonConfig->periDividerIndex;
    cy_en_sysclk_divider_types_t dividerType;
    uint32_t dividerValueLocal = dividerValue;

    if (0u == dividerValueLocal)
    {
        dividerValueLocal = 1u;
    }
    dividerValueLocal--;

    switch (context->ptrCommonConfig->periDividerType)
    {
        case (uint8_t)CY_SYSCLK_DIV_8_BIT:
            dividerType = CY_SYSCLK_DIV_8_BIT;
            break;
        case (uint8_t)CY_SYSCLK_DIV_16_BIT:
            dividerType = CY_SYSCLK_DIV_16_BIT;
            break;
        case (uint8_t)CY_SYSCLK_DIV_16_5_BIT:
            dividerType = CY_SYSCLK_DIV_16_5_BIT;
            break;
        default:
            dividerType = CY_SYSCLK_DIV_24_5_BIT;
            break;
    }

    (void)Cy_SysClk_PeriphDisableDivider(dividerType, dividerIndex);
    if ((CY_SYSCLK_DIV_8_BIT == dividerType) || (CY_SYSCLK_DIV_16_BIT == dividerType))
    {
        (void)Cy_SysClk_PeriphSetDivider(dividerType, dividerIndex, dividerValueLocal);
    }
    else
    {
        (void)Cy_SysClk_PeriphSetFracDivider(dividerType, dividerIndex, dividerValueLocal, 0u);
    }
    (void)Cy_SysClk_PeriphEnableDivider(dividerType, dividerIndex);
}


#if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN) ||\
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN))
/*******************************************************************************
* Function Name: Cy_CapSense_CalibrateSlot
****************************************************************************//**
*
* Calibrates one of the CapDACs for selected slot. The calibration targets
* are specified in the cy_stc_capsense_internal_context_t structure
* as csdCalibrTarget and csxCalibrTarget fields.
*
* \param scanSlotId
* The slot ID calibration scans will be done for.
*
* \param autoCalibrMode
* Specifies the slot auto-calibration mode:
* - CY_CAPSENSE_CAL_MODE_REF_CDAC_SUC_APPR  - The successive approximation
*     (8-9 scans) of RefCDAC with disabled CompCDAC
* - CY_CAPSENSE_CAL_MODE_COMP_CDAC_SUC_APPR - The successive approximation
*     (8-9 scans) of CompCDAC with fixed RefCDAC
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS          - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_CALIBRATION_FAIL - The calibration failed if software
*                                         watchdog timeout occurred
*                                         during any calibration scan,
*                                         the scan was not completed, or
*                                         resulted raw counts
*                                         are outside the limits.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_CalibrateSlot(
                uint32_t scanSlotId,
                uint32_t autoCalibrMode,
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t calibStatus = CY_CAPSENSE_STATUS_SUCCESS;

    uint32_t target;
    uint32_t snsIndex;
    uint32_t wdIndex;
    uint32_t chIndex;
    uint32_t maxRawTmp;
    uint32_t calMaskNext = CY_CAPSENSE_CAL_MIDDLE_VALUE;
    uint32_t calMaskPast = 0u;
    uint32_t calibrationBitEn = 0u;
    uint32_t sensingGroup = CY_CAPSENSE_UNDEFINED_GROUP;
    uint8_t * ptrCdac;
    uint32_t * ptrRawTarget;
    uint32_t rawTarget[CY_CAPSENSE_MAX_CH_NUM];
    cy_stc_capsense_sensor_context_t * ptrSnsCxt;
    cy_stc_capsense_sensor_context_t * ptrSnsCxtArray[CY_CAPSENSE_MAX_CH_NUM];
    const cy_stc_capsense_widget_config_t * ptrWdCfg;

    #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD)
        uint32_t * ptrSnsFrmCxt;
        uint32_t * ptrSnsFrmCxtArray[CY_CAPSENSE_MAX_CH_NUM];
    #endif

    if (0u != Cy_CapSense_IsSlotEnabled(scanSlotId, context))
    {
        /* Checks a slot for auto-calibration */
        for (chIndex = 0u; chIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; chIndex++)
        {
            #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD)
                if (context->ptrInternalContext->hwConfigState != CY_CAPSENSE_HW_CONFIG_REGULAR_SCANNING)
                {
                    /* Generates sensor frame configuration */
                    Cy_CapSense_GenerateAllSensorConfig(chIndex,
                                                    &context->ptrSensorFrameContext[(CY_CAPSENSE_SLOT_COUNT *
                                                    (chIndex + context->ptrCommonConfig->channelOffset)) *
                                                    CY_MSC_6_SNS_REGS], context);
                }
            #endif

            wdIndex = context->ptrScanSlots[scanSlotId + (CY_CAPSENSE_SLOT_COUNT * chIndex)].wdId;
            if (CY_CAPSENSE_SLOT_SHIELD_ONLY > wdIndex)
            {
                /* Finds a sensing method for existing slot */
                sensingGroup = context->ptrWdConfig[wdIndex].senseMethod;
                /* Checks if the auto-calibration is enabled for the current sense method */
                #if (CY_CAPSENSE_DISABLE == CY_CAPSENSE_CSX_CALIBRATION_EN)
                    if (CY_CAPSENSE_CSX_GROUP == sensingGroup)
                    {
                        sensingGroup = CY_CAPSENSE_UNDEFINED_GROUP;
                    }
                #else

                    #if (CY_CAPSENSE_DISABLE == CY_CAPSENSE_CSX_CDAC_REF_AUTO_USAGE)
                        if ((CY_CAPSENSE_CSX_GROUP == sensingGroup) && (CY_CAPSENSE_CAL_MODE_REF_CDAC_SUC_APPR == autoCalibrMode))
                        {
                            sensingGroup = CY_CAPSENSE_UNDEFINED_GROUP;
                        }
                    #endif

                    #if (CY_CAPSENSE_DISABLE == CY_CAPSENSE_CSX_CDAC_COMP_USAGE)
                        if ((CY_CAPSENSE_CSX_GROUP == sensingGroup) && (CY_CAPSENSE_CAL_MODE_COMP_CDAC_SUC_APPR == autoCalibrMode))
                        {
                            sensingGroup = CY_CAPSENSE_UNDEFINED_GROUP;
                        }
                    #endif
                #endif

                #if (CY_CAPSENSE_DISABLE == CY_CAPSENSE_CSD_CALIBRATION_EN)
                    if (CY_CAPSENSE_CSD_GROUP == sensingGroup)
                    {
                        sensingGroup = CY_CAPSENSE_UNDEFINED_GROUP;
                    }
                #else

                    #if (CY_CAPSENSE_DISABLE == CY_CAPSENSE_CSD_CDAC_REF_AUTO_USAGE)
                        if ((CY_CAPSENSE_CSD_GROUP == sensingGroup) && (CY_CAPSENSE_CAL_MODE_REF_CDAC_SUC_APPR == autoCalibrMode))
                        {
                            sensingGroup = CY_CAPSENSE_UNDEFINED_GROUP;
                        }
                    #endif

                    #if (CY_CAPSENSE_DISABLE == CY_CAPSENSE_CSD_CDAC_COMP_USAGE)
                        if ((CY_CAPSENSE_CSD_GROUP == sensingGroup) && (CY_CAPSENSE_CAL_MODE_COMP_CDAC_SUC_APPR == autoCalibrMode))
                        {
                            sensingGroup = CY_CAPSENSE_UNDEFINED_GROUP;
                        }
                    #endif
                #endif

                #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_EXT_CREF_EN)
                    /* Skip RefCDAC calibration for ext Cref widgets */
                    if ((CY_CAPSENSE_CAL_MODE_REF_CDAC_SUC_APPR == autoCalibrMode) &&
                        (CY_CAPSENSE_CREF_SOURCE_EXTERNAL == context->ptrWdConfig[wdIndex].cRefSource))
                    {
                        sensingGroup = CY_CAPSENSE_UNDEFINED_GROUP;
                    }
                #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_EXT_CREF_EN) */

                /* Different sensing methods not allowed in a single slot */
                break;
            }
        }
    }

    /* Skips non-auto-calibrated slots */
    if (CY_CAPSENSE_UNDEFINED_GROUP != sensingGroup)
    {
        for (chIndex = 0u; chIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; chIndex++)
        {
            /* Populates all sensors in widget */
            wdIndex = context->ptrScanSlots[scanSlotId + (CY_CAPSENSE_SLOT_COUNT * chIndex)].wdId;
            if (CY_CAPSENSE_SLOT_SHIELD_ONLY > wdIndex)
            {
                calibrationBitEn |= (uint32_t)(0x01uL << chIndex);

                snsIndex = context->ptrScanSlots[scanSlotId + (CY_CAPSENSE_SLOT_COUNT * chIndex)].snsId;
                ptrWdCfg = &context->ptrWdConfig[wdIndex];

                /* Gets target in percentage */
                target = context->ptrInternalContext->intrCsdRawTarget;

                #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
                    if (CY_CAPSENSE_CSX_GROUP == sensingGroup)
                    {
                        target = context->ptrInternalContext->intrCsxRawTarget;
                    }
                #endif

                maxRawTmp = context->ptrWdContext[wdIndex].maxRawCount;
                #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
                    if ((CY_CAPSENSE_CSD_GROUP == sensingGroup) && (ptrWdCfg->numCols <= snsIndex))
                    {
                        maxRawTmp = context->ptrWdContext[wdIndex].maxRawCountRow;
                    }
                #endif

                rawTarget[chIndex] = (uint16_t)((maxRawTmp * target) / CY_CAPSENSE_PERCENTAGE_100);
                ptrSnsCxtArray[chIndex] = &ptrWdCfg->ptrSnsContext[snsIndex];
                ptrSnsCxtArray[chIndex]->cdacComp = 0u;

