zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_v3.c
                #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD)
                    ptrSnsFrmCxtArray[chIndex] = &context->ptrSensorFrameContext[(CY_MSC_6_SNS_REGS *
                                                ((context->ptrCommonConfig->numSlots * chIndex) + scanSlotId)) + CY_CAPSENSE_SNS_CDAC_CTL_INDEX];
                #endif
            }
        }

        /* Perform repeated continuous scan of a slot and tune CDAC */
        do
        {
            ptrRawTarget = &rawTarget[0u];
            for (chIndex = 0u; chIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; chIndex++)
            {
                if (0u != (calibrationBitEn & (0x01uL << chIndex)))
                {
                    ptrSnsCxt = ptrSnsCxtArray[chIndex];

                    #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD)
                        ptrSnsFrmCxt = ptrSnsFrmCxtArray[chIndex];
                    #endif
                    /* Update CDACs based on scan result */
                    ptrCdac = &ptrSnsCxt->cdacComp;
                    if (CY_CAPSENSE_CSD_GROUP == sensingGroup)
                    {
                        if ((uint32_t)ptrSnsCxt->raw < *ptrRawTarget)
                        {
                            *ptrCdac &= ~(uint8_t)calMaskPast;
                        }
                    }
                    else
                    {
                        if ((uint32_t)ptrSnsCxt->raw >= *ptrRawTarget)
                        {
                            *ptrCdac &= ~(uint8_t)calMaskPast;
                        }
                    }
                    *ptrCdac |= (uint8_t)calMaskNext;
                    if (0u == *ptrCdac)
                    {
                        (*ptrCdac)++;
                    }

                    #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD)
                        if (CY_CAPSENSE_CAL_MODE_REF_CDAC_SUC_APPR == autoCalibrMode)
                        {
                            *ptrSnsFrmCxt &= (uint32_t)~(MSC_SNS_CDAC_CTL_SEL_RE_Msk | MSC_SNS_CDAC_CTL_SEL_CO_Msk);
                            *ptrSnsFrmCxt |= (((uint32_t)(*ptrCdac)) << MSC_SNS_CDAC_CTL_SEL_RE_Pos);
                        }
                        else
                        {
                            *ptrSnsFrmCxt &= (uint32_t)~MSC_SNS_CDAC_CTL_SEL_CO_Msk;
                            *ptrSnsFrmCxt |= (((uint32_t)(*ptrCdac)) << MSC_SNS_CDAC_CTL_SEL_CO_Pos);
                        }
                    #else
                        (void)autoCalibrMode;
                    #endif /* (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD) */
                }
                ptrRawTarget++;
            }

            /* CTRL_MUX + CSX */
            #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD) && (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
                /* Dummy scan */
                if (CY_CAPSENSE_CSX_GROUP == sensingGroup)
                {
                    calibStatus |= Cy_CapSense_ScanSlots(scanSlotId, 1u, context);
                    calibStatus |= Cy_CapSense_WaitEndScan(CY_CAPSENSE_CALIBRATION_TIMEOUT, context);
                }
            #endif

            /* Scan all sensors in slot */
            calibStatus |= Cy_CapSense_ScanSlots(scanSlotId, 1u, context);
            calibStatus |= Cy_CapSense_WaitEndScan(CY_CAPSENSE_CALIBRATION_TIMEOUT, context);

            for (chIndex = 0u; chIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; chIndex++)
            {
                wdIndex = context->ptrScanSlots[scanSlotId + (CY_CAPSENSE_SLOT_COUNT * chIndex)].wdId;
                if (CY_CAPSENSE_SLOT_SHIELD_ONLY > wdIndex)
                {
                    snsIndex = context->ptrScanSlots[scanSlotId + (CY_CAPSENSE_SLOT_COUNT * chIndex)].snsId;
                    Cy_CapSense_PreProcessSensor(wdIndex, snsIndex, context);
                }
            }

            /* Switches to the next cycle */
            calMaskPast = calMaskNext;
            calMaskNext >>= 1u;

        }
        while (calMaskPast != 0u);
    }

    return calibStatus;
}
#endif


#if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN) || \
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN))
/*******************************************************************************
* Function Name: Cy_CapSense_NormalizeCdac
****************************************************************************//**
*
* Finds maximum reference CDAC value within a widget and stores it to the
* proper location in widget structure.
*
* The function supposes to be called after CDAC calibration in single CDAC mode
* when compensation CDAC is disabled and the CompCDAC field is used to store
* reference CDAC.
*
* Additionally, the function reduces reference CDAC value twice if final user's
* auto-calibration has enabled compensation CDAC.
*
* \param widgetId
* Specifies the desired widget ID.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS       - The operation is performed successfully.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_NormalizeCdac(
                uint32_t widgetId,
                cy_stc_capsense_context_t * context)
{
    uint32_t i;
    uint8_t maxRefCdac = 0u;
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
        uint8_t maxRowRefCdac = 0u;
    #endif
    const cy_stc_capsense_widget_config_t * ptrWdCfg = &context->ptrWdConfig[widgetId];
    cy_stc_capsense_sensor_context_t * ptrSnsCxt = ptrWdCfg->ptrSnsContext;
    #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD)
        uint32_t * ptrSnsFrmCxt;
        uint32_t cdacTmp;
    #endif

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
        if (CY_CAPSENSE_CSD_GROUP == ptrWdCfg->senseMethod)
        {
            for (i = 0u; i < ptrWdCfg->numCols; i++)
            {
                if (ptrSnsCxt->cdacComp > maxRefCdac)
                {
                    maxRefCdac = ptrSnsCxt->cdacComp;
                }
                ptrSnsCxt->cdacComp = 0u;
                ptrSnsCxt++;
            }
            for (i = ptrWdCfg->numCols; i < ptrWdCfg->numSns; i++)
            {
                if (ptrSnsCxt->cdacComp > maxRowRefCdac)
                {
                    maxRowRefCdac = ptrSnsCxt->cdacComp;
                }
                ptrSnsCxt->cdacComp = 0u;
                ptrSnsCxt++;
            }
            /* Aligns rows and cols RefCDAC if enabled */
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CDAC_ROW_COL_ALIGN_EN)
                if (maxRefCdac < maxRowRefCdac)
                {
                    maxRefCdac = maxRowRefCdac;
                }
                maxRowRefCdac = maxRefCdac;
            #endif

            /* Normalizes RefCDAC if CompCDAC is enabled */
            #if (0u != CY_CAPSENSE_CSD_CDAC_COMP_USAGE)
                /* Skip CDAC splitting for SmartSense as not needed */
                if (0u == (context->ptrCommonContext->status & CY_CAPSENSE_MW_STATE_SMARTSENSE_MASK))
                {
                    maxRefCdac = (maxRefCdac + 1u) >> 1u;
                    maxRowRefCdac = (maxRowRefCdac + 1u) >> 1u;
                }
            #endif
            ptrWdCfg->ptrWdContext->cdacRef = maxRefCdac;
            ptrWdCfg->ptrWdContext->rowCdacRef = maxRowRefCdac;
        }
    #endif

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
        if (CY_CAPSENSE_CSX_GROUP == ptrWdCfg->senseMethod)
        {
            /* CSX Widget */
            for (i = 0u; i < ptrWdCfg->numSns; i++)
            {
                if (ptrSnsCxt->cdacComp > maxRefCdac)
                {
                    maxRefCdac = ptrSnsCxt->cdacComp;
                }
                ptrSnsCxt->cdacComp = 0u;
                ptrSnsCxt++;
            }
            /* Normalizes RefCDAC if CompCDAC is enabled */
            #if (0u != CY_CAPSENSE_CSX_CDAC_COMP_USAGE)
                maxRefCdac = (maxRefCdac + 1u) >> 1u;
            #endif
            ptrWdCfg->ptrWdContext->cdacRef = maxRefCdac;
        }
    #endif

