zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_v3.c
    calibStatus |= Cy_CapSense_ScanSlots(ptrWdCfg->firstSlotId, ptrWdCfg->numSlots, context);
    calibStatus |= Cy_CapSense_WaitEndScan(CY_CAPSENSE_CALIBRATION_TIMEOUT, context);
    Cy_CapSense_PreProcessWidget(widgetId, context);

    if (CY_CAPSENSE_STATUS_SUCCESS == calibStatus)
    {
        /* Calculate acceptable raw count range based on the resolution, target and error */
        lowerLimit = 0u;
        calibrationError = context->ptrCommonConfig->csxCalibrationError;
        target = context->ptrInternalContext->intrCsxRawTarget;
        if (CY_CAPSENSE_CSD_GROUP == ptrWdCfg->senseMethod)
        {
            calibrationError = context->ptrCommonConfig->csdCalibrationError;
            target = context->ptrInternalContext->intrCsdRawTarget;
        }
        if (target > calibrationError)
        {
            lowerLimit = target - calibrationError;
        }
        upperLimit = target + calibrationError;
        if (upperLimit > CY_CAPSENSE_PERCENTAGE_100)
        {
            upperLimit = CY_CAPSENSE_PERCENTAGE_100;
        }

        /* Finds max raw count value */
        temp = context->ptrWdContext[widgetId].maxRawCount;

        /* Checks raw count of each sensor */
        ptrSnsCxt = &ptrWdCfg->ptrSnsContext[0u];
        if (CY_CAPSENSE_CSD_GROUP == ptrWdCfg->senseMethod)
        {
            for (snsIndex = 0u; snsIndex < ptrWdCfg->numCols; snsIndex++)
            {
                if ((ptrSnsCxt->raw < ((temp * lowerLimit) / CY_CAPSENSE_PERCENTAGE_100)) ||
                    (ptrSnsCxt->raw > ((temp * upperLimit) / CY_CAPSENSE_PERCENTAGE_100)))
                {
                    calibStatus |= CY_CAPSENSE_STATUS_CALIBRATION_CHECK_FAIL;
                    break;
                }
                ptrSnsCxt++;
            }
            temp = context->ptrWdContext[widgetId].maxRawCountRow;

            for (snsIndex = ptrWdCfg->numCols; snsIndex < ptrWdCfg->numSns; snsIndex++)
            {
                if ((ptrSnsCxt->raw < ((temp * lowerLimit) / CY_CAPSENSE_PERCENTAGE_100)) ||
                    (ptrSnsCxt->raw > ((temp * upperLimit) / CY_CAPSENSE_PERCENTAGE_100)))
                {
                    calibStatus |= CY_CAPSENSE_STATUS_CALIBRATION_CHECK_FAIL;
                    break;
                }
                ptrSnsCxt++;
            }
        }
        else
        {
            for (snsIndex = 0u; snsIndex < ptrWdCfg->numSns; snsIndex++)
            {
                if ((ptrSnsCxt->raw < ((temp * lowerLimit) / CY_CAPSENSE_PERCENTAGE_100)) ||
                    (ptrSnsCxt->raw > ((temp * upperLimit) / CY_CAPSENSE_PERCENTAGE_100)))
                {
                    calibStatus |= CY_CAPSENSE_STATUS_CALIBRATION_CHECK_FAIL;
                    break;
                }
                ptrSnsCxt++;
            }
        }
    }

    return calibStatus;
}
#endif


#if ((CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD) &&\
     ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN) || (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN)))
/*******************************************************************************
* Function Name: Cy_CapSense_SetCompDivider
****************************************************************************//**
*
* Sets the desired Compensation divider into sensor frames.
*
* This function takes Compensation Divider value from widget structure and
* applies it to all widget's sensors in sensor frame structures.
* This function must not be called when AMUX mode is configured.
*
* \param widgetId
* Specifies widget ID.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_SetCompDivider(
                uint32_t widgetId,
                cy_stc_capsense_context_t * context)
{
    uint32_t i;
    uint32_t * currentFramePtr;
    const cy_stc_capsense_scan_slot_t * ptrScanSlots = context->ptrScanSlots;
    uint32_t compensationCdacDivider = context->ptrWdContext[widgetId].cdacCompDivider;

    if (0u != compensationCdacDivider)
    {
        compensationCdacDivider--;
    }

    currentFramePtr = &context->ptrSensorFrameContext[CY_CAPSENSE_SNS_SCAN_CTL_INDEX];
    for (i = 0u; i < (CY_CAPSENSE_SLOT_COUNT * CY_CAPSENSE_TOTAL_CH_NUMBER); i++)
    {
        if (ptrScanSlots->wdId == widgetId)
        {
            *currentFramePtr &= ~MSC_SNS_SCAN_CTL_COMP_DIV_Msk;
            *currentFramePtr |= (uint32_t)(compensationCdacDivider << MSC_SNS_SCAN_CTL_COMP_DIV_Pos);
        }
        ptrScanSlots++;
        currentFramePtr = &currentFramePtr[CY_MSC_6_SNS_REGS];
    }
}
#endif


#if ((CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD) &&\
     ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN) || (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN)))
/*******************************************************************************
* Function Name: Cy_CapSense_SetMaxCompCdac
****************************************************************************//**
*
* Sets the maximum Compensation CDAC code into sensor frames.
*
* This function applies maximum Compensation CDAC code for all
* sensors within specified widget in sensor frame structures.
* This function must not be called when AMUX mode is configured.
*
* \param widgetId
* Specifies widget ID.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS       - The operation is performed successfully.
*
*******************************************************************************/
void Cy_CapSense_SetMaxCompCdac(
                uint32_t widgetId,
                cy_stc_capsense_context_t * context)
{
    uint32_t i;
    uint32_t * currentFramePtr;
    const cy_stc_capsense_scan_slot_t * ptrScanSlots = context->ptrScanSlots;

    currentFramePtr = &context->ptrSensorFrameContext[CY_CAPSENSE_SNS_CDAC_CTL_INDEX];
    for (i = 0u; i < (CY_CAPSENSE_SLOT_COUNT * CY_CAPSENSE_TOTAL_CH_NUMBER); i++)
    {
        if (ptrScanSlots->wdId == widgetId)
        {
            *currentFramePtr |= MSC_SNS_CDAC_CTL_SEL_CO_Msk;
        }
        ptrScanSlots++;
        currentFramePtr = &currentFramePtr[CY_MSC_6_SNS_REGS];
    }
}
#endif


