zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_v3.c
    return capStatus;
}
#endif


/*******************************************************************************
* Function Name: Cy_CapSense_SwitchHwConfiguration
****************************************************************************//**
*
* Configures CAPSENSE&trade;-related hardware to the specified state.
*
* \param configuration
* The state of CAPSENSE&trade;-related hardware:
* * CY_CAPSENSE_HW_CONFIG_UNDEFINED.
* * CY_CAPSENSE_HW_CONFIG_CAPTURED_DEFAULT.
* * CY_CAPSENSE_HW_CONFIG_REGULAR_SCANNING.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS      - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_BAD_PARAM    - At least one of input parameters is not valid.
* - CY_CAPSENSE_STATUS_HW_BUSY      - The MSC HW block is busy and cannot be
*                                     configured.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_SwitchHwConfiguration(
                uint32_t configuration,
                cy_stc_capsense_context_t * context)
{
    uint32_t curChIndex;
    cy_en_msc_status_t mscStatus;
    cy_capsense_status_t capStatus = CY_CAPSENSE_STATUS_SUCCESS;
    const cy_stc_capsense_common_config_t * ptrCommonCfg = context->ptrCommonConfig;

    if (context->ptrInternalContext->hwConfigState != configuration)
    {
        /* Turn off the previous HW configuration */
        switch (context->ptrInternalContext->hwConfigState)
        {
            case CY_CAPSENSE_HW_CONFIG_UNDEFINED:
                break;
            case CY_CAPSENSE_HW_CONFIG_CAPTURED_DEFAULT:
                break;
            case CY_CAPSENSE_HW_CONFIG_REGULAR_SCANNING:
                #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
                    if (CY_CAPSENSE_SCAN_SNGL_SLOT == context->ptrInternalContext->scanSingleSlot)
                    {
                        for (curChIndex = 0u; curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; curChIndex++)
                        {
                            /* Disconnect the scanned sensor */
                            Cy_CapSense_DisconnectSensor(curChIndex, context);
                        }
                    }
                #endif
                break;
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_HW_GROUP_EN)
                case CY_CAPSENSE_HW_CONFIG_BIST_FUNCTIONALITY:
                    Cy_CapSense_BistDisableMode(context);
                    break;
            #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_HW_GROUP_EN) */
            case CY_CAPSENSE_HW_CONFIG_CHANNEL_SATURATION:
                break;
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CDAC_AUTO_DITHER_EN)
                case CY_CAPSENSE_HW_CONFIG_AUTO_DITHERING:
                    break;
            #endif
            default:
                capStatus = CY_CAPSENSE_STATUS_BAD_PARAM;
                break;
        }
        if (CY_CAPSENSE_STATUS_SUCCESS == capStatus)
        {
            /* Turn on the desired HW configuration */
            switch (configuration)
            {
                case CY_CAPSENSE_HW_CONFIG_UNDEFINED:
                    break;
                case CY_CAPSENSE_HW_CONFIG_CAPTURED_DEFAULT:
                    break;
                case CY_CAPSENSE_HW_CONFIG_REGULAR_SCANNING:
                    Cy_CapSense_SetModClkDivider(context->ptrInternalContext->modClk, context);
                    Cy_CapSense_SetIOsInDefaultState(context);
                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)
                        Cy_CapSense_SetShieldPinsInDefaultState(context);
                    #endif
                    #if (CY_CAPSENSE_EXT_CREF_EN == CY_CAPSENSE_ENABLE)
                        /* Set ext cref pins HSIOM to CSD_SENSE once during HW configuration.
                         * Per-slot activation is handled by function mode mask registers. */
                        if (NULL != context->ptrExtCrefPinConfig)
                        {
                            Cy_CapSense_SsConfigPinRegisters(
                                context->ptrExtCrefPinConfig[CY_CAPSENSE_PIN_IDX_EXT_CREF0].pcPtr,
                                (uint32_t)context->ptrExtCrefPinConfig[CY_CAPSENSE_PIN_IDX_EXT_CREF0].pinNumber,
                                CY_CAPSENSE_DM_GPIO_ANALOG, CY_CAPSENSE_HSIOM_SEL_CSD_SENSE);
                            Cy_CapSense_SsConfigPinRegisters(
                                context->ptrExtCrefPinConfig[CY_CAPSENSE_PIN_IDX_EXT_CREF1].pcPtr,
                                (uint32_t)context->ptrExtCrefPinConfig[CY_CAPSENSE_PIN_IDX_EXT_CREF1].pinNumber,
                                CY_CAPSENSE_DM_GPIO_ANALOG, CY_CAPSENSE_HSIOM_SEL_CSD_SENSE);
                        }
                    #endif /* (CY_CAPSENSE_EXT_CREF_EN == CY_CAPSENSE_ENABLE) */

                    #if (CY_CAPSENSE_SCAN_MODE_DMA_DRIVEN == CY_CAPSENSE_SCAN_MODE)
                        (void)Cy_CapSense_InitializeDmaResource(context);
                        /* Set undefined value to initiate DMA configuration in Cy_CapSense_ScanSlots() function */
                        context->ptrInternalContext->currentSlotIndex = CY_CAPSENSE_SLOT_COUNT_MAX_VALUE;
                    #endif /* (CY_CAPSENSE_SCAN_MODE_DMA_DRIVEN == CY_CAPSENSE_SCAN_MODE) */

                    for (curChIndex = 0u; curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; curChIndex++)
                    {
                        context->ptrActiveScanSns[curChIndex].currentSenseMethod = CY_CAPSENSE_UNDEFINED_GROUP;

                        #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
                            Cy_CapSense_SetCmodInAmuxModeState(curChIndex, context);
                        #else
                            Cy_CapSense_SetCmodInDefaultState(curChIndex, context);
                        #endif

                        /* MSCv3 IP Block Base Register Configuration */
                        mscStatus = Cy_MSC_Configure(ptrCommonCfg->ptrChConfig[curChIndex].ptrHwBase,
                                                    &context->ptrBaseFrameContext[curChIndex],
                                                    CY_MSC_CAPSENSE_KEY,
                                                    ptrCommonCfg->ptrChConfig[curChIndex].ptrHwContext);
                        if (CY_MSC_SUCCESS != mscStatus)
                        {
                            capStatus = CY_CAPSENSE_STATUS_HW_BUSY;
                            break;
                        }

                        /* Clear all pending interrupts of the MSC HW block */
                        ptrCommonCfg->ptrChConfig[curChIndex].ptrHwBase->INTR = CY_CAPSENSE_MSC_INTR_ALL_MSK;
                        (void)ptrCommonCfg->ptrChConfig[curChIndex].ptrHwBase->INTR;
                    }

                    break;
                case CY_CAPSENSE_HW_CONFIG_BIST_FUNCTIONALITY:
                    Cy_CapSense_SetIOsInDefaultState(context);

