zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_v3.c
                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)
                        Cy_CapSense_SetShieldPinsInDefaultState(context);
                    #endif
                    #if (CY_CAPSENSE_EXT_CREF_EN == CY_CAPSENSE_ENABLE)
                        /* Set ext cref pins HSIOM to CSD_SENSE for BIST mode */
                        if (NULL != context->ptrExtCrefPinConfig)
                        {
                            Cy_CapSense_SsConfigPinRegisters(
                                context->ptrExtCrefPinConfig[CY_CAPSENSE_PIN_IDX_EXT_CREF0].pcPtr,
                                (uint32_t)context->ptrExtCrefPinConfig[CY_CAPSENSE_PIN_IDX_EXT_CREF0].pinNumber,
                                CY_CAPSENSE_DM_GPIO_ANALOG, CY_CAPSENSE_HSIOM_SEL_CSD_SENSE);
                            Cy_CapSense_SsConfigPinRegisters(
                                context->ptrExtCrefPinConfig[CY_CAPSENSE_PIN_IDX_EXT_CREF1].pcPtr,
                                (uint32_t)context->ptrExtCrefPinConfig[CY_CAPSENSE_PIN_IDX_EXT_CREF1].pinNumber,
                                CY_CAPSENSE_DM_GPIO_ANALOG, CY_CAPSENSE_HSIOM_SEL_CSD_SENSE);
                        }
                    #endif /* (CY_CAPSENSE_EXT_CREF_EN == CY_CAPSENSE_ENABLE) */

                    for (curChIndex = 0u; curChIndex < context->ptrCommonConfig->numChannels; curChIndex++)
                    {
                        context->ptrActiveScanSns[curChIndex].currentSenseMethod = CY_CAPSENSE_UNDEFINED_GROUP;
                        Cy_CapSense_SetCmodInDefaultState(curChIndex, context);
                        /* Clear all pending interrupts of the MSC HW block */
                        ptrCommonCfg->ptrChConfig[curChIndex].ptrHwBase->INTR = CY_CAPSENSE_MSC_INTR_ALL_MSK;
                        (void)ptrCommonCfg->ptrChConfig[curChIndex].ptrHwBase->INTR;
                    }
                    break;
                case CY_CAPSENSE_HW_CONFIG_CHANNEL_SATURATION:
                    capStatus = Cy_CapSense_ConfigureSaturationMode(context);
                    break;
                #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CDAC_AUTO_DITHER_EN)
                    case CY_CAPSENSE_HW_CONFIG_AUTO_DITHERING:
                        capStatus = Cy_CapSense_ConfigureAutoDitherMode(context);
                        break;
                #endif
                default:
                    capStatus = CY_CAPSENSE_STATUS_BAD_PARAM;
                    break;
            }
        }
        if (CY_CAPSENSE_STATUS_SUCCESS == capStatus)
        {
            context->ptrInternalContext->hwConfigState = (uint8_t)configuration;
        }
    }

    return capStatus;
}


/*******************************************************************************
* Function Name: Cy_CapSense_InitializeSourceSenseClk
****************************************************************************//**
*
* Performs the Sense Clock source and the LFSR auto-selection functionality.
* Validates the Sense Clock configuration.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS          - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_BAD_CLOCK_CONFIG - Sense Clock Divider is out of the valid
*                                         range for the specified Clock source
*                                         configuration.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_InitializeSourceSenseClk(const cy_stc_capsense_context_t * context)
{
    uint32_t wdIndex;
    uint32_t snsClkSrc;
    uint32_t prsConfigured = 0u;
    uint32_t snsClkDivMin;
    uint32_t lfsrRange;

    uint32_t retVal = CY_CAPSENSE_STATUS_SUCCESS;

    cy_stc_capsense_widget_context_t * ptrWdCxt;
    const cy_stc_capsense_widget_config_t * ptrWdCfg = context->ptrWdConfig;

    for (wdIndex = 0u; wdIndex < context->ptrCommonConfig->numWd; wdIndex++)
    {
        ptrWdCxt = ptrWdCfg->ptrWdContext;
        snsClkSrc = ptrWdCxt->snsClkSource;

        if ((0u != (snsClkSrc & CY_CAPSENSE_CLK_SOURCE_SSC_AUTO_MASK)) ||
           (CY_CAPSENSE_CLK_SOURCE_SSC == (snsClkSrc & CY_CAPSENSE_CLK_SOURCE_MASK)))
        {
            if (0u != (ptrWdCxt->lfsrBits & CY_CAPSENSE_LFSR_BITS_AUTO_MASK))
            {
                /*
                * Execute the LFSR range auto-selection functionality when the
                * Sense Clock source parameter is configured with the SSC or
                * SSC-auto option, and the LFSR range parameter is configured with
                * the auto option.
                */
                ptrWdCxt->lfsrBits = (uint8_t)Cy_CapSense_GetLfsrBitsAuto(ptrWdCfg, context);
            }

            if (0u != (snsClkSrc & CY_CAPSENSE_CLK_SOURCE_SSC_AUTO_MASK))
            {
                /*
                * Execute SSC auto-selection functionality when the
                * Sense Clock source parameter is configured with the SSC-Auto
                * option. This routine performs checking if the SSC clock source
                * is valid for the widget, specified by the input parameter.
                */
                ptrWdCxt->snsClkSource = (uint8_t)Cy_CapSense_GetClkSrcSSCAuto(ptrWdCfg, context);
            }
        }
        else if (0u != (snsClkSrc & CY_CAPSENSE_CLK_SOURCE_PRS_AUTO_MASK))
        {
            /*
            * Execute PRS auto-selection functionality when the
            * Sense Clock source parameter is configured with the PRS-Auto.
            * This routine performs checking if the PRS clock source is valid
            * for the widget, specified by the input parameter.
            */
            ptrWdCxt->snsClkSource = (uint8_t)Cy_CapSense_GetClkSrcPRSAuto(ptrWdCxt, context);
        }
        else
        {
            /*
            * No action required. The Sense Clock source and the LFSR range
            * parameter are configured with the fixed option (Direct, PRS or
            * SSC - for the Sense Clock source parameter and [-2; 1], [-4; 3],
            * [-8; 7] and [-16; 15] - for the LFSR range parameter.)
            */
        }

        /* Determine the MIN valid Sense Clock divider for the used sensing method. */
        if (CY_CAPSENSE_CSD_GROUP == ptrWdCfg->senseMethod)
        {
            snsClkDivMin = CY_CAPSENSE_4PH_DIRECT_SNS_CLOCK_DIVIDER_MIN;
        }
        else
        {
            snsClkDivMin = CY_CAPSENSE_2PH_DIRECT_SNS_CLOCK_DIVIDER_MIN;
        }

