zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_v3.c
/*******************************************************************************
* Function Name: Cy_CapSense_GetLfsrDitherLimit
****************************************************************************//**
*
* Determines the max allowed clock dithering variation for the specified
* parameters.
*
* \param snsClkDivider
* The divider value for the sense clock.
*
* \param snsClkDividerMin
* The minimal valid value of the sense clock divider.
*
* \param ditherLimitPercents
* Max dither in percentage, the actual clock dither should be limited with.
*
* \param lfsrScale
*  Number of bits to shift the LFSR output left before adding to SENSE_DIV.
*
* \return
*  Dintering variation in the number of Mod Clock cycles.
*
*******************************************************************************/
uint32_t Cy_CapSense_GetLfsrDitherLimit(
                uint32_t snsClkDivider,
                uint32_t snsClkDividerMin,
                uint32_t ditherLimitPercents,
                uint32_t lfsrScale)
{
    uint32_t ditherLimitCycles;
    uint32_t ditherLimitCyclesMax;

    /*
    * Determine the dither limit in clock cycles for the specified Dither limit
    * in percents.
    */
    ditherLimitCycles = ((ditherLimitPercents * snsClkDivider) / CY_CAPSENSE_PERCENTAGE_100);
    ditherLimitCycles >>= lfsrScale;

    /* Determine MAX allowed dither in cycles for the specified Sense Clock divider. */
    ditherLimitCyclesMax = (snsClkDivider - snsClkDividerMin) / (1u << lfsrScale);

    /*
    * Determine the minimal value to eliminate violation of allowed Sense Clock
    * divider range.
    */
    if (ditherLimitCycles > ditherLimitCyclesMax)
    {
        ditherLimitCycles = ditherLimitCyclesMax;
    }

    return ditherLimitCycles;
}


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_SMARTSENSE_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_SsAutoTune
****************************************************************************//**
*
* Performs the parameters auto-tuning for the optimal CAPSENSE&trade; operation when
* smart sensing algorithm is enabled.
*
* This function performs the following tasks:
* - Tune the Sense Clock optimal value.
* - Calculate the number of sub-conversions for the optimal finger capacitance.
*
* \note
* The function supposes final auto-calibration is called right after this
* function.
*
* \note
* Widgets configured with External Cref are excluded from all SmartSense tuning steps.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - Zero     - All the widgets are auto-tuned successfully.
* - Non-zero - Auto-tuning failed for any widget.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_SsAutoTune(cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t autoTuneStatus = CY_CAPSENSE_STATUS_SUCCESS;
    uint32_t i;
    uint32_t j;
    uint32_t watchdogCounter;
    MSC_Type * mscBase;
    uint32_t curChIndex;
    uint32_t rawCountMax;
    uint32_t numberSubConv;
    cy_stc_capsense_hw_smartsense_config_t autoTuneConfig;
    const cy_stc_capsense_widget_config_t * ptrWdCfg;
    cy_stc_capsense_widget_context_t * ptrWdCxt;
    cy_stc_capsense_sensor_context_t * ptrSnsCxt;
    const cy_stc_capsense_common_config_t * ptrCommonCfg = context->ptrCommonConfig;
    cy_stc_capsense_common_context_t * ptrCommonCxt = context->ptrCommonContext;
    #if (CY_CAPSENSE_TOTAL_CH_NUMBER > 1u)
        uint32_t loopFlag;
        uint64_t wdIdMask;
        uint32_t maxDivider;
        uint32_t maxSubconversions;
        uint32_t wdIndex[CY_CAPSENSE_MAX_CH_NUM];
    #endif /* (CY_CAPSENSE_TOTAL_CH_NUMBER > 1u) */

    ptrCommonCxt->status |= CY_CAPSENSE_MW_STATE_SMARTSENSE_MASK;

    /* Step #0: Check if configuration is valid */
    if ((ptrCommonCfg->counterMode != CY_CAPSENSE_COUNTER_MODE_SATURATE) ||
        (ptrCommonCfg->numWd > CY_CAPSENSE_SMARTSENSE_WD_MAX_NUMBER))
    {
        autoTuneStatus |= CY_CAPSENSE_STATUS_BAD_CONFIG;
    }

    /* Step #1: Sets the default parameters for preliminary scans */
    ptrWdCfg = context->ptrWdConfig;
    for (i = 0u; i < ptrCommonCfg->numWd; i++)
    {
        if (CY_CAPSENSE_CSD_GROUP == ptrWdCfg->senseMethod)
        {
            #if (CY_CAPSENSE_EXT_CREF_EN == CY_CAPSENSE_ENABLE)
                /* Skip SmartSense for ext Cref widgets */
                if (CY_CAPSENSE_CREF_SOURCE_EXTERNAL == ptrWdCfg->cRefSource)
                {
                    ptrWdCfg++;
                    continue;
                }
            #endif /* (CY_CAPSENSE_EXT_CREF_EN == CY_CAPSENSE_ENABLE) */

            /* Initializes SmartSense scan configuration */
            ptrWdCxt = ptrWdCfg->ptrWdContext;
            ptrWdCxt->snsClkSource <<= CY_CAPSENSE_CLK_SOURCE_SMARTSENSE_POS;
            ptrWdCxt->numSubConversions = CY_CAPSENSE_SMARTSENSE_PRELIMINARY_SCAN_NSUB;
            ptrWdCxt->cdacRef = CY_CAPSENSE_SMARTSENSE_PRELIMINARY_SCAN_REF_CDAC;
            ptrWdCxt->rowCdacRef = CY_CAPSENSE_SMARTSENSE_PRELIMINARY_SCAN_REF_CDAC;
            ptrWdCxt->snsClk = CY_CAPSENSE_SMARTSENSE_PRELIMINARY_SCAN_SNS_CLK;
            ptrWdCxt->rowSnsClk = CY_CAPSENSE_SMARTSENSE_PRELIMINARY_SCAN_SNS_CLK;
            ptrSnsCxt = ptrWdCfg->ptrSnsContext;
            for (j = 0u; j < ptrWdCfg->numSns; j++)
            {
                ptrSnsCxt->cdacComp = 0u;
                ptrSnsCxt++;
            }
        }
        ptrWdCfg++;
    }
    autoTuneStatus |= Cy_CapSense_SsInitialize(context);

    for (curChIndex = 0u; curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; curChIndex++)
    {
        mscBase = ptrCommonCfg->ptrChConfig[curChIndex].ptrHwBase;

        mscBase->SCAN_CTL2 &= (uint32_t)~((uint32_t)MSC_SCAN_CTL2_NUM_EPI_CYCLES_Msk);
        mscBase->SCAN_CTL2 |= (uint32_t)((uint32_t)CY_CAPSENSE_SMARTSENSE_PRELIMINARY_SCAN_SNS_CLK <<
                                                   MSC_SCAN_CTL2_NUM_EPI_CYCLES_Pos);

        mscBase->INIT_CTL4 &= (uint32_t)~((uint32_t)MSC_INIT_CTL4_NUM_PRO_WAIT_CYCLES_Msk);
        mscBase->INIT_CTL4 |= (uint32_t)((uint32_t)CY_CAPSENSE_SMARTSENSE_PRELIMINARY_SCAN_SNS_CLK <<
                                                   MSC_INIT_CTL4_NUM_PRO_WAIT_CYCLES_Pos);
    }

    /* Step #2: Execute preliminary scan */
    autoTuneStatus |= Cy_CapSense_SwitchHwConfiguration(CY_CAPSENSE_HW_CONFIG_REGULAR_SCANNING, context);
    autoTuneStatus |= Cy_CapSense_ScanAllSlots(context);

    /* Initialize the watchdog counter to prevent a hang */
    watchdogCounter = Cy_CapSense_WatchdogCyclesNum(CY_CAPSENSE_CALIBRATION_TIMEOUT,
                                                    (context->ptrCommonConfig->cpuClkHz / CY_CAPSENSE_CONVERSION_MEGA),
                                                    CY_CAPSENSE_LOOP_DURATION_CYCLES);

    /* Wait till the end of preliminary scans for the calculated timeout */
    autoTuneStatus |= Cy_CapSense_WaitEndScan(watchdogCounter, context);

