zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_v3.c
    /*
     * Step #3: Calculate sensor capacitances, sense clock dividers, and sub-conversion numbers depending on the configured
     * serial resistances, and finger capacitances for each sensor
     */
    autoTuneConfig.modClock = ptrCommonCfg->periClkHz / context->ptrInternalContext->modClk;
    autoTuneConfig.snsResistance = CY_CAPSENSE_SMARTSENSE_CSD_RESISTANCE_CONST;
    autoTuneConfig.correctionCoeff = CY_CAPSENSE_SENSOR_CONNECTION_MODE;

    ptrWdCfg = context->ptrWdConfig;
    for (i = 0u; i < CY_CAPSENSE_WIDGET_COUNT; i++)
    {
        if ((CY_CAPSENSE_CSD_GROUP == ptrWdCfg->senseMethod) && (0u != Cy_CapSense_IsWidgetEnabled(i, context)))
        {
            #if (CY_CAPSENSE_EXT_CREF_EN == CY_CAPSENSE_ENABLE)
                /* Skip SmartSense tuning for ext Cref widgets */
                if (CY_CAPSENSE_CREF_SOURCE_EXTERNAL == ptrWdCfg->cRefSource)
                {
                    ptrWdCfg++;
                    continue;
                }
            #endif /* (CY_CAPSENSE_EXT_CREF_EN == CY_CAPSENSE_ENABLE) */

            ptrWdCxt = ptrWdCfg->ptrWdContext;
            autoTuneConfig.kRef0 = ptrWdCxt->snsClk;
            autoTuneConfig.nSub0 = ptrWdCxt->numSubConversions;
            autoTuneConfig.refCdac = ptrWdCxt->cdacRef;
            autoTuneConfig.fingerCap = ptrWdCxt->fingerCap;

            rawCountMax = 0u;
            for (j = 0u; j < ptrWdCfg->numSns; j++)
            {
                if (rawCountMax < ptrWdCfg->ptrSnsContext[j].raw)
                {
                    rawCountMax = ptrWdCfg->ptrSnsContext[j].raw;
                }
            }

            autoTuneConfig.raw = (uint16_t)rawCountMax;
            (void)Cy_CapSense_GetSmartSenseCapacitance(&autoTuneConfig);
            autoTuneConfig.snsCapacitance /= ptrWdCfg->numChopCycles;
            (void)Cy_CapSense_GetSmartSenseFrequencyDivider(&autoTuneConfig);

            #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_MULTI_FREQUENCY_WIDGET_EN)
                /* Check for sub-widget */
                if (0u != (ptrWdCfg->mfsConfig & CY_CAPSENSE_MFS_EN_MASK))
                {
                    if (0u != (ptrWdCfg->mfsConfig & CY_CAPSENSE_MFS_WIDGET_FREQ_CH_1_MASK))
                    {
                        autoTuneConfig.kRef1 += CY_CAPSENSE_CSD_MFS_DIVIDER_OFFSET_F1;
                    }

                    if (0u != (ptrWdCfg->mfsConfig & CY_CAPSENSE_MFS_WIDGET_FREQ_CH_2_MASK))
                    {
                        autoTuneConfig.kRef1 += CY_CAPSENSE_CSD_MFS_DIVIDER_OFFSET_F2;
                    }
                }
            #endif

            /* Configure widget sense clock divider by the calculated value */
            ptrWdCxt->snsClk = autoTuneConfig.kRef1;
            ptrWdCxt->rowSnsClk = autoTuneConfig.kRef1;

            (void)Cy_CapSense_GetSmartSenseNumSubconversions(&autoTuneConfig);

            /* Calculates max possible Nsub value */
            numberSubConv = MSC_RESULT_FIFO_RD_RAW_COUNT_Msk >> MSC_RESULT_FIFO_RD_RAW_COUNT_Pos;
            numberSubConv /= autoTuneConfig.kRef1;

            /* Limits Nsub to avoid RawCount overflow */
            if ((uint16_t)numberSubConv > autoTuneConfig.nSub1)
            {
                numberSubConv = autoTuneConfig.nSub1;
            }

            ptrWdCxt->numSubConversions = (uint16_t)numberSubConv / ptrWdCfg->numChopCycles;
            /* Decrease Nsub when CompCDAC is enabled as it increases the sensitivity approximately twice */
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CDAC_COMP_USAGE)
                ptrWdCxt->numSubConversions >>= 1u;
                numberSubConv = (uint32_t)ptrWdCxt->numSubConversions << 1u;
            #endif
            numberSubConv *= ptrWdCfg->numChopCycles;

            /*
             * numberSubConv contains real value including chopping and compensation.
             * autoTuneConfig.nSub1 contains initially calculated value.
             * So, correcting the initially calculated sensitivity.
             */
            autoTuneConfig.sigPFC = (uint16_t)((numberSubConv * autoTuneConfig.sigPFC) / autoTuneConfig.nSub1);
            ptrWdCxt->sigPFC = autoTuneConfig.sigPFC;
        }
        ptrWdCfg++;
    }

    /* Step #4: Align SnsClkDiv and Nsub for multi-channel solution */
    #if (CY_CAPSENSE_TOTAL_CH_NUMBER > 1u)
        /* Implemented faster algorithm to align frequency across all slots */
        ptrWdCfg = context->ptrWdConfig;
        /* Reset the widget group to initial state, no widgets in group */
        wdIdMask = 0u;
        maxDivider = 1u;
        maxSubconversions = 1u;
        /* A single loop through all slots */
        for (i = 0u; i < CY_CAPSENSE_SLOT_COUNT; i++)
        {
            /* Save widget IDs for the current slot */
            for (j = 0u; j < CY_CAPSENSE_TOTAL_CH_NUMBER; j++)
            {
                wdIndex[j] = context->ptrScanSlots[i + (j * CY_CAPSENSE_SLOT_COUNT)].wdId;
            }

            /* If CSX then, update the current group, reset the widget group and switch to the next slot */
            loopFlag = 0u;
            for (j = 0u; j < CY_CAPSENSE_TOTAL_CH_NUMBER; j++)
            {
                if (wdIndex[j] < CY_CAPSENSE_SLOT_SHIELD_ONLY)
                {
                    if (CY_CAPSENSE_CSX_GROUP == ptrWdCfg[wdIndex[j]].senseMethod)
                    {
                        /* Updates the current group */
                        Cy_CapSense_SsAutoTuneScanDurationAlignment(wdIdMask, maxDivider, maxSubconversions, context);
                        /* Reset the widget group to initial state, no widgets in group */
                        wdIdMask = 0u;
                        maxDivider = 1u;
                        maxSubconversions = 1u;
                        /* Sets a flag to switch to the new slot */
                        loopFlag = 1u;
                        break;
                    }
                }
            }
            if (0u != loopFlag)
            {
                continue;
            }

