zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_v3.c
            /* Check if new slot has overlapping with widget group */
            loopFlag = 0u;
            for (j = 0u; j < CY_CAPSENSE_TOTAL_CH_NUMBER; j++)
            {
                if (wdIndex[j] < CY_CAPSENSE_TOTAL_WIDGET_COUNT)
                {
                    if (0u != (wdIdMask & (1uLL << wdIndex[j])))
                    {
                        /* It has, so continue the same group */
                        loopFlag = 1u;
                        break;
                    }
                }
            }

            if (0u == loopFlag)
            {
                /* Updates the current group */
                Cy_CapSense_SsAutoTuneScanDurationAlignment(wdIdMask, maxDivider, maxSubconversions, context);
                /* Reset the widget group to initial state, no widgets in group */
                wdIdMask = 0u;
                maxDivider = 1u;
                maxSubconversions = 1u;
            }

            /* Process new slot with the widget group */
            for (j = 0u; j < CY_CAPSENSE_TOTAL_CH_NUMBER; j++)
            {
                if (wdIndex[j] < CY_CAPSENSE_TOTAL_WIDGET_COUNT)
                {
                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_EXT_CREF_EN)
                        /* Skip ext Cref widgets - SmartSense not supported */
                        if (CY_CAPSENSE_CREF_SOURCE_EXTERNAL == ptrWdCfg[wdIndex[j]].cRefSource)
                        {
                            continue;
                        }
                    #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_EXT_CREF_EN) */

                    /* Adds widget to a group */
                    wdIdMask |= 1uLL << wdIndex[j];
                    /* Stores max divider for a group */
                    if (maxDivider < ptrWdCfg[wdIndex[j]].ptrWdContext->snsClk)
                    {
                        maxDivider = ptrWdCfg[wdIndex[j]].ptrWdContext->snsClk;
                    }
                    /* Stores max number of sub-conversions for a group */
                    if (maxSubconversions < ptrWdCfg[wdIndex[j]].ptrWdContext->numSubConversions)
                    {
                        maxSubconversions = ptrWdCfg[wdIndex[j]].ptrWdContext->numSubConversions;
                    }
                }
            }
        }
        /* If no more slots, the current widget group still need to be updated */
        Cy_CapSense_SsAutoTuneScanDurationAlignment(wdIdMask, maxDivider, maxSubconversions, context);
    #endif /* (CY_CAPSENSE_TOTAL_CH_NUMBER > 1u) */

    /* Step #5: Restore project parameters */
    ptrWdCfg = context->ptrWdConfig;
    for (i = 0u; i < CY_CAPSENSE_WIDGET_COUNT; i++)
    {
        if ((CY_CAPSENSE_CSD_GROUP == ptrWdCfg->senseMethod) && (0u != Cy_CapSense_IsWidgetEnabled(i, context)))
        {
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_EXT_CREF_EN)
                /* Skip ext Cref widgets - their params were not modified by SmartSense */
                if (CY_CAPSENSE_CREF_SOURCE_EXTERNAL != ptrWdCfg->cRefSource)
            #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_EXT_CREF_EN) */
            {
                ptrWdCxt = ptrWdCfg->ptrWdContext;
                /* Reverting back original customer's settings */
                ptrWdCxt->snsClkSource = (uint8_t)(((uint32_t)ptrWdCxt->snsClkSource >> CY_CAPSENSE_CLK_SOURCE_SMARTSENSE_POS) &
                                         ~CY_CAPSENSE_CLK_SOURCE_SMARTSENSE_MASK);
            }
        }
        ptrWdCfg++;
    }

    autoTuneStatus |= Cy_CapSense_SsInitialize(context);

    ptrCommonCxt->status &= ~CY_CAPSENSE_MW_STATE_SMARTSENSE_MASK;

    return autoTuneStatus;
}


/*******************************************************************************
* Function Name: Cy_CapSense_SsAutoTuneScanDurationAlignment
****************************************************************************//**
*
* Updates specified widgets with provided SnsClk/TxClk and Nsub.
*
* \param widgetMask
* A mask of widgets. The first bit correspond to a widget with ID = 0. The
* second bit corresponds to widget with ID = 1. And so on.
*
* \param clockDivider
* Specifies a divider should be configured.
*
* \param subConversion
* Specifies a number of sub-conversions should be configured.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_SsAutoTuneScanDurationAlignment(
                uint64_t widgetMask,
                uint32_t clockDivider,
                uint32_t subConversion,
                cy_stc_capsense_context_t * context)
{
    cy_stc_capsense_widget_context_t * ptrWdCxt = context->ptrWdContext;
    uint64_t widgetMaskLocal = widgetMask;

    while (widgetMaskLocal != 0u)
    {
        if (0u != (widgetMaskLocal & 0x01u))
        {
            ptrWdCxt->snsClk = (uint16_t)clockDivider;
            ptrWdCxt->rowSnsClk = (uint16_t)clockDivider;
            ptrWdCxt->numSubConversions = (uint16_t)subConversion;
        }
        widgetMaskLocal >>= 1u;
        ptrWdCxt++;
    }
}
#endif


#if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CIC2_FILTER_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_GetCIC2SamplesMax
****************************************************************************//**
*
* This internal function determines the MAX number of CIC2 samples for specified
* decimation rate that can be accumulated in the internal CIC2 HW register
* with no overflow.
*
* \param cic2Rate
* CIC2 decimation rate.
*
* \return
* The MAX allowed number of CIC2 samples.
*
*******************************************************************************/
uint32_t Cy_CapSense_GetCIC2SamplesMax(
                uint32_t cic2Rate)
{
    uint32_t retVal;

    retVal = CY_CAPSENSE_CIC2_ACC_MAX_VAL / (cic2Rate * cic2Rate);

    return retVal;
}


/*******************************************************************************
* Function Name: Cy_CapSense_GetCIC2HwDivider
****************************************************************************//**
*
* This internal function determines the value of the divider that will be
* applied to the data, accumulated by the CIC2 HW for the specified number of
* samples.
*
* \param cic2Samples
* The number of CIC2 samples for the specified sensing parameters. This value
* can be obtained by using the Cy_CapSense_GetCIC2SamplesNum function.
*
* \return
* The CIC2 HW divider value.
*
*******************************************************************************/
uint32_t Cy_CapSense_GetCIC2HwDivider(
                uint32_t cic2Samples)
{
    uint32_t cic2Divider;

    if (cic2Samples > CY_CAPSENSE_CIC2_DIVIDER_8)
    {
        cic2Divider = CY_CAPSENSE_CIC2_DIVIDER_16;
    }
    else if (cic2Samples > CY_CAPSENSE_CIC2_DIVIDER_4)
    {
        cic2Divider = CY_CAPSENSE_CIC2_DIVIDER_8;
    }
    else if (cic2Samples > CY_CAPSENSE_CIC2_DIVIDER_2)
    {
        cic2Divider = CY_CAPSENSE_CIC2_DIVIDER_4;
    }
    else if (cic2Samples > CY_CAPSENSE_CIC2_DIVIDER_1)
    {
        cic2Divider = CY_CAPSENSE_CIC2_DIVIDER_2;
    }
    else
    {
        cic2Divider = CY_CAPSENSE_CIC2_DIVIDER_1;
    }

    return cic2Divider;
}
#endif /* #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CIC2_FILTER_EN) */


