zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_v3.c
/*******************************************************************************
* Function Name: Cy_CapSense_ExecuteSaturatedScan
****************************************************************************//**
*
* This internal function executes a scan with the saturated channel to obtain
* the MAX raw count or the scan duration for the specified scan slot.
*
* \param ptrMaxRaw
* Specifies the pointer to store the resulting MAX raw count value.
*
* \param scanSlotId
* The slot ID scans will be done for.
*
* \param mode
* Saturated scan execution mode:
* - CY_CAPSENSE_SATURATED_MAX_COUNT   - Used to obtain the MAX raw count.
* - CY_CAPSENSE_SATURATED_SCAN_TIME   - Used to obtain the scan duration in terms of Mod Clock cycles.
*
* \param context
* The pointer to the context structure allocated by the user or middleware.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS      - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_TIMEOUT      - A timeout reached during the scan time measurement.
* - CY_CAPSENSE_STATUS_BAD_PARAM    - Not valid input parameter.
* - CY_CAPSENSE_STATUS_HW_BUSY      - The MSCLP HW block is busy and cannot be
*                                     switched to another mode.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_ExecuteSaturatedScan(
                uint32_t * ptrMaxRaw,
                uint32_t scanSlotId,
                uint32_t mode,
                cy_stc_capsense_context_t * context)
{
    uint32_t tmpVal;
    uint32_t watchdog;
    uint32_t scanConfigTmp[CY_MSC_6_SNS_REGS];
    cy_capsense_status_t status;
    #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD)
        uint32_t * ptrSnsFrame;
    #endif

    const uint32_t cpuCyclesPerLoop = 5u;
    MSC_Type * ptrHwBase = context->ptrCommonConfig->ptrChConfig[0u].ptrHwBase;

    (void)mode;

    /* Configures the MSC HW block for operation with the permanently saturated channel. */
    status = Cy_CapSense_SwitchHwConfiguration(CY_CAPSENSE_HW_CONFIG_CHANNEL_SATURATION, context);

    /* The MSC0 HW block will be used to perform measurements. Rest of MSC HW blocks will be disabled. */
    for (tmpVal = 1u; tmpVal < CY_CAPSENSE_TOTAL_CH_NUMBER; tmpVal++)
    {
        ptrHwBase = context->ptrCommonConfig->ptrChConfig[tmpVal].ptrHwBase;
        ptrHwBase->CTL &= (~MSC_CTL_ENABLED_Msk);
    }

    ptrHwBase = context->ptrCommonConfig->ptrChConfig[0u].ptrHwBase;

    /* Disable CIC2 filtering to measure the scan duration in in terms of Mod Clock cycles */
    ptrHwBase->FILTER_CTL &= (~MSC_FILTER_CTL_FILTER_MODE_Msk);

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CIC2_FILTER_EN)
        if (CY_CAPSENSE_SATURATED_MAX_COUNT == mode)
        {
            /* Keep CIC2 filtering enabled if it is used in the current MW configuration
             * to measure the MAX raw count.
             */
            ptrHwBase->FILTER_CTL |= (MSC_FILTER_CTL_FILTER_MODE_Msk);
        }
    #endif

    #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD)
        /* Obtain the scan parameters offset in the cy_capsense_sensorFrameContext[]
         * array for the slots that are part of Active widgets.
         */
        tmpVal = scanSlotId * CY_MSC_6_SNS_REGS;
        /* The code below sets up configuration of the sense control registers. */
        ptrSnsFrame = &context->ptrSensorFrameContext[tmpVal];
        scanConfigTmp[3u] = ptrSnsFrame[3u]; /* Set up the SNS_SCAN_CTL register configuration. */
        scanConfigTmp[4u] = ptrSnsFrame[4u]; /* Set up the SNS_CDAC_CTL register configuration. */
        scanConfigTmp[5u] = ptrSnsFrame[5u]; /* Set up the SNS_CTL register configuration. */
    #else
        for (tmpVal = 0u; tmpVal < CY_CAPSENSE_TOTAL_CH_NUMBER; tmpVal++)
        {
            context->ptrActiveScanSns[tmpVal].currentChannelSlotIndex = (uint16_t)scanSlotId;
        }
        (void)Cy_CapSense_GenerateSensorConfig(0u, scanSlotId, &scanConfigTmp[0u], context);
    #endif

    /* The measurement with a saturated channel will be performed with all the sensors disconnected.
     * The code below sets up the configuration of the MASK registers with 0x00000000u.
     * The SW_SEL_CSW_FUNC[0u] is configured in the scope of the Cy_CapSense_ConfigureSaturationMode()
     * routine with all the switches open.
     */
    scanConfigTmp[0u] = 0x00u; /* Set up the SNS_SW_SEL_CSW_MASK2 register configuration. */
    scanConfigTmp[1u] = 0x00u; /* Set up the SNS_SW_SEL_CSW_MASK1 register configuration. */
    scanConfigTmp[2u] = 0x00u; /* Set up the SNS_SW_SEL_CSW_MASK0 register configuration. */

    scanConfigTmp[3u] &= (uint32_t)(~MSC_SNS_SCAN_CTL_NUM_CONV_Msk); /* Disable System Chopping */

    if (status == CY_CAPSENSE_STATUS_SUCCESS)
    {
        /* Initiate the scan in the CPU operating mode */
        Cy_MSC_ConfigureScan(ptrHwBase, CY_MSC_6_SNS_REGS, &scanConfigTmp[0u]);

        /* Disable clock sync and external frame start */
        ptrHwBase->CTL &= ~(MSC_CTL_CLK_SYNC_EN_Msk | MSC_CTL_EXT_FRAME_START_EN_Msk);

        /* Clear all pending interrupts */
        ptrHwBase->INTR = CY_CAPSENSE_MSC_INTR_ALL_MSK;
        (void)ptrHwBase->INTR;

        /* Set the multi-channel mode configuration to OFF */
        ptrHwBase->SNS_CTL &= (~MSC_SNS_CTL_MULTI_CH_MODE_Msk);

        /* Configure the last slot */
        ptrHwBase->SNS_CTL |= MSC_SNS_CTL_LAST_Msk | MSC_SNS_CTL_VALID_Msk;

        /* Start scanning with START_SCAN */
        ptrHwBase->SNS_CTL |= MSC_SNS_CTL_START_SCAN_Msk;

        /* Start FSM with START_FRAME */
        ptrHwBase->FRAME_CMD = MSC_FRAME_CMD_START_FRAME_Msk;

        watchdog = Cy_CapSense_GetScanWatchdogTime(scanSlotId, context);
        tmpVal = context->ptrCommonConfig->cpuClkHz / CY_CAPSENSE_CONVERSION_MEGA;
        watchdog = Cy_CapSense_WatchdogCyclesNum(watchdog, tmpVal, cpuCyclesPerLoop);

        while ((ptrHwBase->INTR & MSC_INTR_MASK_SCAN_Msk) == 0u)
        {
            if (0uL == watchdog)
            {
                break;
            }
            watchdog--;
        }

