zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_v3.c
        tmpVal = (uint16_t)ptrHwBase->RESULT_FIFO_RD;

        #if (CY_CAPSENSE_DISABLE == CY_CAPSENSE_CIC2_FILTER_EN)
            tmpVal -= ((uint32_t)context->ptrInternalContext->numEpiCycles - 1u);
            tmpVal *= context->ptrWdConfig->numChopCycles;
        #endif

        *ptrMaxRaw = CY_CAPSENSE_16_BIT_MASK;
        if (tmpVal <= CY_CAPSENSE_16_BIT_MASK)
        {
            *ptrMaxRaw = (uint16_t)tmpVal;
        }

        /* Clear all pending interrupts */
        ptrHwBase->INTR = CY_CAPSENSE_MSC_INTR_ALL_MSK;
        (void)ptrHwBase->INTR;

        /* Restore clock sync and external frame start settings */
        ptrHwBase->CTL |= (uint32_t)(((uint32_t)context->ptrCommonConfig->syncFrameStartEn << MSC_CTL_EXT_FRAME_START_EN_Pos) |
                                     ((uint32_t)context->ptrCommonConfig->syncClockEn << MSC_CTL_CLK_SYNC_EN_Pos));

        if (0u == watchdog)
        {
            status |= CY_CAPSENSE_STATUS_TIMEOUT;
        }
    }

    return status;
}


/*******************************************************************************
* Function Name: Cy_CapSense_ConfigureSaturationMode
****************************************************************************//**
*
* Configures the MSC HW block for operation with the permanently saturated
* channel.
* The raw data counter is continuously enabled from the beginning to the end of
* the scan. The scan is performed in the CPU operating mode.
*
* \param context
* The pointer to the context structure allocated by the user or middleware.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS          - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_HW_BUSY          - The MSCLP HW block is busy and cannot be
*                                         configured.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_ConfigureSaturationMode(
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t status = CY_CAPSENSE_STATUS_SUCCESS;
    cy_en_msc_status_t mscStatus;
    uint32_t curChIndex;
    uint32_t i;
    MSC_Type * ptrHwBase;
    const cy_stc_capsense_common_config_t * ptrCommonCfg = context->ptrCommonConfig;

    /* Initializes all enabled MSC channels for scan */
    for (curChIndex = 0u; curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; curChIndex++)
    {
        ptrHwBase = ptrCommonCfg->ptrChConfig[curChIndex].ptrHwBase;

        /* Generates base frame configurations for all enabled MSC channels */
        status |= Cy_CapSense_GenerateBaseConfig(curChIndex, context);

        if (CY_CAPSENSE_STATUS_SUCCESS != status)
        {
            break;
        }

        #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD)
            /* Generates sensor frame configuration */
            Cy_CapSense_GenerateAllSensorConfig(curChIndex,
                                            &context->ptrSensorFrameContext[(CY_CAPSENSE_SLOT_COUNT *
                                            (curChIndex + context->ptrCommonConfig->channelOffset)) *
                                            CY_MSC_6_SNS_REGS], context);
        #endif

        /* MSCv3 IP Block Base Register Configuration */
        mscStatus = Cy_MSC_Configure(ptrHwBase,
                                    &context->ptrBaseFrameContext[curChIndex],
                                    CY_MSC_CAPSENSE_KEY,
                                    ptrCommonCfg->ptrChConfig[curChIndex].ptrHwContext);

        if (CY_MSC_SUCCESS != mscStatus)
        {
            status = CY_CAPSENSE_STATUS_HW_BUSY;
        }
    }

    if (CY_CAPSENSE_STATUS_SUCCESS == status)
    {
        ptrHwBase = context->ptrCommonConfig->ptrChConfig[0u].ptrHwBase;

        /* Enables HW IP to allow a scan frame start */
        ptrHwBase->CTL |= MSC_CTL_ENABLED_Msk;

        /* Disables all interrupts */
        ptrHwBase->INTR_MASK = 0x00u;
        (void)ptrHwBase->INTR_MASK;

        /* The 0x00 value of the OPERATING_MODE field switches the HW to the CPU
        * configures it to generate VDDA/2 voltage at the output.
        */
        CY_REG32_CLR_SET(ptrHwBase->CTL, MSC_CTL_OPERATING_MODE, 0u);

        /* Configures the Switch Control Global Function #0 to have all switches open.
        * All the sensing electrodes will be disconnected during the MAX raw count measurement.
        */
        ptrHwBase->SW_SEL_CSW_FUNC[0u] = 0x00u;

        /* Iterates through all the MODE structures and update them with the configuration,
        * required to saturate the measurement channel.
        */
        for (i = 0u; i < MSC0_SENSE_MODE_NR; i++)
        {
            /* The 0x01 value of the RMF field enables the internal voltage divider and
            * configures it to generate VDDA/2 voltage at the output.
            */
            ptrHwBase->MODE[i].SW_SEL_TOP  = _VAL2FLD(MSC_MODE_SW_SEL_TOP_RMF, 0x01u);

            /* Sets the CPF and the CMG bits to get the positive comparator input connected
            * to the VDDA/2 voltage level and the negative comparator input to the GND.
            */
            ptrHwBase->MODE[i].SW_SEL_COMP = _VAL2FLD(MSC_MODE_SW_SEL_COMP_CPF, 0x01u) |
                                            _VAL2FLD(MSC_MODE_SW_SEL_COMP_CMG, 0x01u);
        }
    }

    return status;
}


/*******************************************************************************
* Function Name: Cy_CapSense_GetScanWatchdogTime
****************************************************************************//**
*
* This internal function calculates the watchdog time in microseconds for the
* specified slot. The calculated value is the duration of one sample with the
* five-time margin.
*
* WATCHDOG_TIME = (SCAN_CYCLES / MOD_CLK_FREQ) * 5;
*
* where:
*
* SCAN_CYCLES = INIT_CYCLES + (PRO_CYCLES + CONV_CYCLES + EPI_CYCLES) * NUM_CONV;
* INIT_CYCLES = INIT_CMOD_RAIL_CYCLES + INIT_CMOD_SHORT_CYCLES;
* PRO_CYCLES = PRO_OFFSET_CYCLES + PRO_WAIT_KREF_DELAY;
* CONV_CYCLES = (PRO_DUMMY_SUB_CONVS + NUM_SUB_CONVS) * SENSE_DIV;
* EPI_CYCLES = EPI_KREF_DELAY;
*
* The corresponding parameters are listed below:
* - EPI_KREF_DELAY - The duration of EPILOGUE defined in relation to Kref.
*   The value is interpreted as number of clk_mod cycles.
* - INIT_CMOD_RAIL_CYCLES - Duration of the coarse initialization phase when
*   Cmod1 is connected to VDDA and Cmod2 is connected to VSSA. The parameter is
*   defined in terms of Mod Clock cycles.
* - INIT_CMOD_SHORT_CYCLES - Duration of the coarse short phase when
*   Cmod1 and Cmod2 are shorted together. The parameter is defined in terms of
*   Mod Clock cycles.
* - PRO_OFFSET_CYCLES - Maximum number of Mod Clock cycles to be assigned for
*   the PRO_OFFSET state. If NUM_PRO_OFFSET_TRIPS are observed before this
*   timeout, exit at that point.
* - PRO_DUMMY_SUB_CONVS - Number of sub-conversions (dummy cycles) to be run
*   during PRO_DUMMY.
* - PRO_WAIT_KREF_DELAY - The duration of PRO_WAIT defined in relation to Kref.
*   The value is interpreted as SENSE_DIV increments.
* - SENSE_DIV - The length of one sub-conversion in terms of Mod Clock cycles.
* - NUM_SUB_CONVS - Number of sub-conversions.
* - NUM_CONV - Number of chop cycles.
* - MOD_CLK_FREQ - Modulation clock frequency.
*
* \param scanSlotId
* The slot ID the watchdog time calculation will be done for.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns watch-dog time interval in microseconds.
*
*******************************************************************************/
uint32_t Cy_CapSense_GetScanWatchdogTime(
                uint32_t scanSlotId,
                cy_stc_capsense_context_t * context)
{
    uint32_t tmpVal;
    uint32_t snsClkDivider;
    uint32_t modClkFreqMhz;
    const cy_stc_capsense_widget_config_t * ptrWdCfg;
    const cy_stc_capsense_scan_slot_t * ptrScanSlots;

