zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_v3.c
    /* Define the MARGIN_KOEFF = 5 */
    const uint32_t watchdogTimeMarginCoeff = 5u;

    modClkFreqMhz  = context->ptrCommonConfig->periClkHz;
    modClkFreqMhz /= context->ptrInternalContext->modClk;
    modClkFreqMhz /= CY_CAPSENSE_CONVERSION_MEGA;

    /* Initialize pointers with the configuration address for the specified scan slot and MSC channel #0 */
    ptrScanSlots = &context->ptrScanSlots[scanSlotId];
    ptrWdCfg = &context->ptrWdConfig[ptrScanSlots->wdId];

    /* For the multi-channel mode, iterate through enabled channels and find the sensing channel that
     * drives the sensor (not Shield only, Tx only, or Empty).
     */
    #if (1u < CY_CAPSENSE_TOTAL_CH_NUMBER)
        for (tmpVal = 0u; tmpVal < CY_CAPSENSE_TOTAL_CH_NUMBER; tmpVal++)
        {
            ptrScanSlots = &context->ptrScanSlots[scanSlotId + (CY_CAPSENSE_SLOT_COUNT * tmpVal)];
            if (CY_CAPSENSE_SLOT_SHIELD_ONLY > ptrScanSlots->wdId)
            {
                ptrWdCfg = &context->ptrWdConfig[ptrScanSlots->wdId];
                break;
            }
        }
    #endif

    /* Initialize the .snsClkDivider field with the value for the slot that is
    *  specified by the scanSlotId parameter of the function.
    */
    snsClkDivider = ptrWdCfg->ptrWdContext->snsClk;
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
        if (CY_CAPSENSE_CSD_GROUP == ptrWdCfg->senseMethod)
        {
            #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_TOUCHPAD_EN) ||\
                 (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_MATRIX_EN))
                if (ptrWdCfg->numCols <= ptrScanSlots->snsId)
                {
                    snsClkDivider = ptrWdCfg->ptrWdContext->rowSnsClk;
                }
            #endif /* CY_CAPSENSE_CSD_TOUCHPAD_EN || CY_CAPSENSE_CSD_MATRIX_EN */
                    }
    #endif /* CY_CAPSENSE_CSD_EN */

    /* Calculate the CONV_CYCLES number. */
    tmpVal = ((uint32_t)context->ptrInternalContext->numFineInitCycles + ptrWdCfg->ptrWdContext->numSubConversions);
    tmpVal *= snsClkDivider;

    if (CY_CAPSENSE_CLK_SOURCE_PRS == (ptrWdCfg->ptrWdContext->snsClkSource & CY_CAPSENSE_CLK_SOURCE_MASK))
    {
        /* Taking into account correction that is implemented in the Cy_CapSense_AdjustSnsClkDivider() function,
         * the scan duration is two time longer if the PRS is used as the sense clock source.
         */
        tmpVal <<= 1u;
    }

    /* Add the PRO_CYCLES number. */
    tmpVal += ((uint32_t)context->ptrInternalContext->numProOffsetCycles + context->ptrInternalContext->numFineInitWaitCycles);

    /* Add the EPI_CYCLES. The .numEpiCycles parameter is defined in terms of
     * Mod Clock cycles for the fifth-generation devices.
    */
    tmpVal += (uint32_t)context->ptrInternalContext->numEpiCycles;

    /* Calculate the SCAN_CYCLES number by multiplying the Mod Clock cycles number per one chop cycle by
    *  number of chop cycles.
    */
    tmpVal *= ptrWdCfg->numChopCycles;

    /* Add the INIT_CYCLES number. */
    tmpVal += ((uint32_t)context->ptrInternalContext->numCoarseInitChargeCycles + context->ptrInternalContext->numCoarseInitSettleCycles);

    /* Convert the calculated duration in terms of clk_mod cycles to the microseconds. */
    tmpVal /= modClkFreqMhz;

    /* Multiply the calculated value by the MARGIN_KOEFF value. */
    tmpVal *= watchdogTimeMarginCoeff;

    return tmpVal;
}


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CDAC_AUTO_DITHER_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_ConfigureAutoDitherMode
****************************************************************************//**
*
* Configures the MSC HW block for operation in the auto-dithering mode.
*
* \param context
* The pointer to the context structure allocated by the user or middleware.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS          - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_CONFIG_OVERFLOW  - The number of pin function exceeds the limit.
* - CY_CAPSENSE_STATUS_BAD_CONFIG       - The function does not suppose to be
*                                         called with the current CAPSENSE&trade;
*                                         configuration.
* - CY_CAPSENSE_STATUS_HW_BUSY          - The MSCLP HW block is busy and cannot be
*                                         configured.
*
*******************************************************************************/
static cy_capsense_status_t Cy_CapSense_ConfigureAutoDitherMode(
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t status = CY_CAPSENSE_STATUS_SUCCESS;
    cy_en_msc_status_t mscStatus;
    const cy_stc_capsense_common_config_t * ptrCommonCfg = context->ptrCommonConfig;
    uint32_t curChIndex;
    MSC_Type * ptrHwBase;

    Cy_CapSense_SetModClkDivider(context->ptrInternalContext->modClk, context);
    Cy_CapSense_SetIOsInDefaultState(context);
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)
        Cy_CapSense_SetShieldPinsInDefaultState(context);
    #endif

    /* Initializes all enabled MSC channels for scan */
    for (curChIndex = 0u; curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; curChIndex++)
    {
        context->ptrActiveScanSns[curChIndex].currentSenseMethod = CY_CAPSENSE_UNDEFINED_GROUP;

        #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
            Cy_CapSense_SetCmodInAmuxModeState(curChIndex, context);
        #else
            Cy_CapSense_SetCmodInDefaultState(curChIndex, context);
        #endif

        ptrHwBase = ptrCommonCfg->ptrChConfig[curChIndex].ptrHwBase;

        /* Generates base frame configurations for all enabled MSC channels */
        status |= Cy_CapSense_GenerateBaseConfig(curChIndex, context);

        if (CY_CAPSENSE_STATUS_SUCCESS == status)
        {
            #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD)
                /* Generates sensor frame configuration */
                Cy_CapSense_GenerateAllSensorConfig(curChIndex,
                                                &context->ptrSensorFrameContext[(CY_CAPSENSE_SLOT_COUNT *
                                                (curChIndex + context->ptrCommonConfig->channelOffset)) *
                                                CY_MSC_6_SNS_REGS], context);
            #endif

            /* MSCv3 IP Block Base Register Configuration */
            mscStatus = Cy_MSC_Configure(ptrHwBase,
                                        &context->ptrBaseFrameContext[curChIndex],
                                        CY_MSC_CAPSENSE_KEY,
                                        ptrCommonCfg->ptrChConfig[curChIndex].ptrHwContext);

