zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_v3.c
            if (CY_MSC_SUCCESS != mscStatus)
            {
                status = CY_CAPSENSE_STATUS_HW_BUSY;
            }
        }

        if (CY_CAPSENSE_STATUS_SUCCESS == status)
        {
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CIC2_FILTER_EN)
                /* Sets FILTER_MODE to CIC1 */
                ptrHwBase->FILTER_CTL &= ~MSC_FILTER_CTL_FILTER_MODE_Msk;
            #endif /* CY_CAPSENSE_CIC2_FILTER_EN */

            /* Clears all pending interrupts of the current MSC HW block */
            ptrCommonCfg->ptrChConfig[curChIndex].ptrHwBase->INTR = CY_CAPSENSE_MSC_INTR_ALL_MSK;
            (void)ptrCommonCfg->ptrChConfig[curChIndex].ptrHwBase->INTR;

            /* Disables all interrupts */
            ptrHwBase->INTR_MASK = 0x00u;
            (void)ptrHwBase->INTR_MASK;

            /* Enables HW IP to allow a scan frame start */
            ptrHwBase->CTL |= MSC_CTL_ENABLED_Msk;

            ptrHwBase->CTL &= ~MSC_CTL_OPERATING_MODE_Msk;
        }
        else
        {
            break;
        }
    }

    return status;
}


/*******************************************************************************
* Function Name: Cy_CapSense_CdacDitherScaleCalc
****************************************************************************//**
*
* This internal function calculates the dither scale value based on highest
* raw count value in AUTO dithering mode.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return status
* Returns the status of the operation (different statuses can be combined):
* - CY_CAPSENSE_STATUS_SUCCESS          - The operation is performed
*                                         successfully.
* - CY_CAPSENSE_STATUS_BAD_PARAM        - At least one of input parameters is
*                                         not valid.
* - CY_CAPSENSE_STATUS_HW_BUSY          - The HW is busy with the previous scan.
*
*******************************************************************************/
static cy_capsense_status_t Cy_CapSense_CdacDitherScaleCalc(
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t status = CY_CAPSENSE_STATUS_SUCCESS;
    const cy_stc_capsense_widget_config_t * ptrWdCfg;
    cy_stc_capsense_sensor_context_t * ptrSnsCxt;
    uint32_t watchdog;
    uint32_t wdIndex;
    uint32_t slotId;
    uint32_t rawCountMax;
    uint32_t curChIndex;
    uint32_t slotValue;
    uint32_t scanSlotIndexValid;
    uint32_t scanFlag;
    #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
        uint32_t snsIndex;
    #endif
    uint32_t slotIndex;
    MSC_Type * ptrHwBase;
    const cy_stc_capsense_scan_slot_t * ptrScanSlots;

    /* Forces HW configuration update on the next scan */
    status = Cy_CapSense_SwitchHwConfiguration(CY_CAPSENSE_HW_CONFIG_AUTO_DITHERING, context);

    /* Performs scans for active slots */
    for (slotId = 0u; slotId < CY_CAPSENSE_SLOT_COUNT; slotId++)
    {
        scanFlag = 0u;

        for (curChIndex = 0u; curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; curChIndex++)
        {
            context->ptrActiveScanSns[curChIndex].currentChannelSlotIndex = (uint16_t)slotId;
            slotIndex = slotId + (curChIndex * CY_CAPSENSE_SLOT_COUNT);
            ptrScanSlots = &context->ptrScanSlots[slotIndex];
            slotValue = ptrScanSlots->wdId;
            scanSlotIndexValid = slotIndex;

            if (CY_CAPSENSE_SLOT_EMPTY == slotValue)
            {
                #if (CY_CAPSENSE_TOTAL_CH_NUMBER > 1u)
                    if (slotIndex < CY_CAPSENSE_SLOT_COUNT)
                    {
                        scanSlotIndexValid += CY_CAPSENSE_SLOT_COUNT;
                    }
                    else
                    {
                        scanSlotIndexValid -= CY_CAPSENSE_SLOT_COUNT;
                    }
                #endif
            }
            else if (CY_CAPSENSE_SLOT_SHIELD_ONLY <= slotValue)
            {
                scanSlotIndexValid = ((uint32_t)ptrScanSlots->snsId * CY_CAPSENSE_SLOT_COUNT) + slotId;
            }
            else
            {
                /* Do nothing */
            }

            /* Initializes for each channel the active sensor structure for the current sensor */
            wdIndex = context->ptrScanSlots[scanSlotIndexValid].wdId;
            ptrWdCfg = &context->ptrWdConfig[wdIndex];

            #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
                snsIndex = context->ptrScanSlots[scanSlotIndexValid].snsId;
                (void)Cy_CapSense_ConfigureAnalogMuxResource(curChIndex, context->ptrWdConfig[wdIndex].senseMethod, context);
                Cy_CapSense_InitActivePtr(curChIndex, wdIndex, snsIndex, context);

                if ((slotValue != CY_CAPSENSE_SLOT_EMPTY) &&
                    (slotValue != CY_CAPSENSE_SLOT_SHIELD_ONLY))
                    {
                        /* Connects the widget first sensor electrodes */
                        Cy_CapSense_ConnectSensor(curChIndex, context);
                    }
            #endif

            if (CY_CAPSENSE_CDAC_DITHERING_MODE_AUTO == ptrWdCfg->cdacDitherScaleMode)
            {
                /* Handles only CSD and CSX widgets */
                if (CY_CAPSENSE_ISX_GROUP != ptrWdCfg->senseMethod)
                {
                    #if (CY_CAPSENSE_EXT_CREF_EN == CY_CAPSENSE_ENABLE)
                        /* Skip auto-dither scan for ext Cref widgets */
                        if (CY_CAPSENSE_CREF_SOURCE_EXTERNAL != ptrWdCfg->cRefSource)
                    #endif /* (CY_CAPSENSE_EXT_CREF_EN == CY_CAPSENSE_ENABLE) */
                    {
                        /* Sets a flag to perform scan */
                        scanFlag = 1u;
                    }
                }
            }
        }

        if (0u != scanFlag)
        {
            for (curChIndex = 0u; curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; curChIndex++)
            {
                ptrHwBase = context->ptrCommonConfig->ptrChConfig[curChIndex].ptrHwBase;
                ptrHwBase->FRAME_CMD = MSC_FRAME_CMD_START_FRAME_Msk;
            }
            
            for (curChIndex = 0u; curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; curChIndex++)
            {
                ptrHwBase = context->ptrCommonConfig->ptrChConfig[curChIndex].ptrHwBase;
                slotIndex = slotId + (curChIndex * CY_CAPSENSE_SLOT_COUNT);
                status = Cy_CapSense_CdacDitherConfigScan(ptrHwBase, curChIndex, ((curChIndex * CY_CAPSENSE_SLOT_COUNT) + slotId), slotIndex * CY_MSC_6_SNS_REGS, context);
            }
            watchdog = CY_CAPSENSE_CDAC_DITHERING_MOD_CLK_PERIODS;
            ptrHwBase = context->ptrCommonConfig->ptrChConfig[0u].ptrHwBase;

            /* Waits end of scan */
            while ((ptrHwBase->INTR & MSC_INTR_MASK_SCAN_Msk) == 0u)
            {
                if (0uL == watchdog)
                {
                    break;
                }
                watchdog--;
            }

            if (0u == watchdog)
            {
                status |= CY_CAPSENSE_STATUS_TIMEOUT;
            }
            else
            {
                for (curChIndex = 0u; curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; curChIndex++)
                {
                    ptrHwBase = context->ptrCommonConfig->ptrChConfig[curChIndex].ptrHwBase;
                    ptrScanSlots = &context->ptrScanSlots[slotId + (CY_CAPSENSE_SLOT_COUNT * curChIndex)];

                    if (CY_CAPSENSE_SLOT_SHIELD_ONLY > ptrScanSlots->wdId)
                    {
                        ptrWdCfg = &context->ptrWdConfig[context->ptrScanSlots[slotId + (curChIndex * CY_CAPSENSE_SLOT_COUNT)].wdId];

                        if (CY_CAPSENSE_CDAC_DITHERING_MODE_AUTO == ptrWdCfg->cdacDitherScaleMode)
                        {
                            /* Handles only CSD and CSX widgets */
                            if (CY_CAPSENSE_ISX_GROUP != ptrWdCfg->senseMethod)
                            {
                                ptrSnsCxt = &ptrWdCfg->ptrSnsContext[context->ptrScanSlots[slotId + (curChIndex * CY_CAPSENSE_SLOT_COUNT)].snsId];

                                /* Reads raw counts */
                                ptrSnsCxt->raw = (uint16_t)(ptrHwBase->RESULT_FIFO_RD & MSC_RESULT_FIFO_RD_RAW_COUNT_Msk);
                            }
                        }
                    }
                    /* Clears all pending interrupts */
                    ptrHwBase->INTR = CY_CAPSENSE_MSC_INTR_ALL_MSK;
                    (void)ptrHwBase->INTR;

                    #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
                        if (CY_CAPSENSE_SNS_CONNECTED == context->ptrActiveScanSns[curChIndex].connectedSnsState)
                        {
                            /* Disconnects the scanned sensor */
                            Cy_CapSense_DisconnectSensor(curChIndex, context);
                        }
                    #endif
                }
            }
        }
    }

