zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_v3.c
    if (status == CY_CAPSENSE_STATUS_SUCCESS)
    {
        for (wdIndex = 0u; wdIndex < CY_CAPSENSE_TOTAL_WIDGET_COUNT; wdIndex++)
        {
            ptrWdCfg = &context->ptrWdConfig[wdIndex];
            if (CY_CAPSENSE_CDAC_DITHERING_MODE_AUTO == ptrWdCfg->cdacDitherScaleMode)
            {
                #if (CY_CAPSENSE_EXT_CREF_EN == CY_CAPSENSE_ENABLE)
                    /* Skip auto-dither calculation for ext Cref widgets */
                    if (CY_CAPSENSE_CREF_SOURCE_EXTERNAL == ptrWdCfg->cRefSource)
                    {
                        continue;
                    }
                #endif /* (CY_CAPSENSE_EXT_CREF_EN == CY_CAPSENSE_ENABLE) */

                rawCountMax = 0u;
                ptrSnsCxt = ptrWdCfg->ptrSnsContext;

                for (slotId = 0u; slotId < ptrWdCfg->numSns; slotId++)
                {
                    /* Finds the biggest raw count value in widget */
                    if (ptrSnsCxt->raw > rawCountMax)
                    {
                        rawCountMax = ptrSnsCxt->raw;
                    }
                    ptrSnsCxt++;
                }

                #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
                    /* Divides the result by 2 for the FW CSX scanning method */
                    if (CY_CAPSENSE_CSX_GROUP == ptrWdCfg->senseMethod)
                    {
                        rawCountMax >>= 1u;
                    }
                #endif

                /* Sets dither value according to measured widget raw counts */
                if (rawCountMax < CY_CAPSENSE_DITHERING_SNS_CAP_300_FEMTO_RAW)
                {
                    ptrWdCfg->ptrWdContext->cdacDitherValue = 6u;
                } else if (rawCountMax < CY_CAPSENSE_DITHERING_SNS_CAP_500_FEMTO_RAW)
                {
                    ptrWdCfg->ptrWdContext->cdacDitherValue = 5u;
                } else if (rawCountMax < CY_CAPSENSE_DITHERING_SNS_CAP_1000_FEMTO_RAW)
                {
                    ptrWdCfg->ptrWdContext->cdacDitherValue = 4u;
                } else if (rawCountMax < CY_CAPSENSE_DITHERING_SNS_CAP_3000_FEMTO_RAW)
                {
                    ptrWdCfg->ptrWdContext->cdacDitherValue = 3u;
                } else if (rawCountMax < CY_CAPSENSE_DITHERING_SNS_CAP_5000_FEMTO_RAW)
                {
                    ptrWdCfg->ptrWdContext->cdacDitherValue = 2u;
                } else if (rawCountMax < CY_CAPSENSE_DITHERING_SNS_CAP_10000_FEMTO_RAW)
                {
                    ptrWdCfg->ptrWdContext->cdacDitherValue = 1u;
                } else
                {
                    ptrWdCfg->ptrWdContext->cdacDitherValue = 0u;
                }
            }
        }
    }

    return status;
}


/*******************************************************************************
* Function Name: Cy_CapSense_CdacDitherConfigScan
****************************************************************************//**
*
* This internal function configures and performs scanning for a slot.
*
* \param ptrHwBase
* The pointer to HW base pointer for current channel.
*
* \param chId
* Specifies the ID number of the channel
*
* \param slotId
* Specifies the ID number of the slot.
*
* \param snsFrameIdx
* The index of sensor frame context structure.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return status
* Returns the status of the operation (different statuses can be combined):
* - CY_CAPSENSE_STATUS_SUCCESS       - The operation is performed
*                                      successfully.
* - CY_CAPSENSE_STATUS_TIMEOUT       - The software watchdog timeout occurred
*                                      during the scan, the scan was not completed.
*
*******************************************************************************/
static cy_capsense_status_t Cy_CapSense_CdacDitherConfigScan(
                MSC_Type * ptrHwBase,
                uint32_t chId,
                uint32_t slotId,
                uint32_t snsFrameIdx,
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t status = CY_CAPSENSE_STATUS_SUCCESS;

    uint32_t scanConfigTmp[CY_MSC_6_SNS_REGS] = {0u, 0u, 0u, 0u, 0u, 0u};
    #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD)
        (void)snsFrameIdx;
        (void)chId;
        (void)slotId;
        uint32_t index;
    #endif

    #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD)
        /* Inherits sensor frame to local array */
        for (index = 0; index < CY_MSC_6_SNS_REGS; index++)
        {
            scanConfigTmp[index] = context->ptrSensorFrameContext[snsFrameIdx + index];
        }
    #else /* CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD */
        /* Getting the sensor frame configuration */
        (void)Cy_CapSense_GenerateSensorConfig(chId, slotId, &scanConfigTmp[0u], context);
    #endif

    /* Configures Sensor Clock, Clock Sources, set the multi-channel mode configuration to OFF */
    scanConfigTmp[CY_CAPSENSE_SNS_CTL_INDEX] &= (uint32_t)~(MSC_SNS_CTL_START_SCAN_Msk | MSC_SNS_CTL_MULTI_CH_MODE_Msk |
                                                            MSC_SNS_CTL_SENSE_DIV_Msk | MSC_SNS_CTL_LFSR_MODE_Msk);
    scanConfigTmp[CY_CAPSENSE_SNS_CTL_INDEX] |= ((((uint32_t)CY_CAPSENSE_CDAC_DITHERING_KREF - 1u) << MSC_SNS_CTL_SENSE_DIV_Pos) |
                                                 MSC_SNS_CTL_LAST_Msk | MSC_SNS_CTL_VALID_Msk | MSC_SNS_CTL_START_SCAN_Msk);

    if (1u < CY_CAPSENSE_TOTAL_CH_NUMBER)
    {
        scanConfigTmp[CY_CAPSENSE_SNS_CTL_INDEX] |= (CY_CAPSENSE_SYNC_INTERNAL << MSC_SNS_CTL_MULTI_CH_MODE_Pos);
    }

    /* Disables chopping. Configures Number of sub-conversions, Compensation divider */
    scanConfigTmp[CY_CAPSENSE_SNS_SCAN_CTL_INDEX] &= (uint32_t)~(MSC_SNS_SCAN_CTL_NUM_CONV_Msk |
                                                                 MSC_SNS_SCAN_CTL_NUM_SUB_CONVS_Msk |
                                                                 MSC_SNS_SCAN_CTL_COMP_DIV_Msk);
    scanConfigTmp[CY_CAPSENSE_SNS_SCAN_CTL_INDEX] |= ((((uint32_t)CY_CAPSENSE_CDAC_DITHERING_NUM_SUBCONV - 1u) << MSC_SNS_SCAN_CTL_NUM_SUB_CONVS_Pos) |
                                                     (((uint32_t)CY_CAPSENSE_CDAC_DITHERING_COMP_DIV - 1u) << MSC_SNS_SCAN_CTL_COMP_DIV_Pos));

    /* Configures Cap DACs and Clock reference rate*/
    scanConfigTmp[CY_CAPSENSE_SNS_CDAC_CTL_INDEX] = 0u;
    scanConfigTmp[CY_CAPSENSE_SNS_CDAC_CTL_INDEX] |= (((uint32_t)CY_CAPSENSE_CDAC_DITHERING_CDAC_REF << MSC_SNS_CDAC_CTL_SEL_RE_Pos) |
                                                     ((uint32_t)CY_CAPSENSE_CDAC_DITHERING_CLOCK_REF_RATE << MSC_SNS_CDAC_CTL_CLOCK_REF_RATE_Pos));

    /* Initiates the scan in the CPU operating mode */
    Cy_MSC_ConfigureScan(ptrHwBase, CY_MSC_6_SNS_REGS, &scanConfigTmp[0u]);

    return status;
}
#endif /* CY_CAPSENSE_CDAC_AUTO_DITHER_EN */

#endif /* CY_IP_M0S8MSCV3 */


/* [] END OF FILE */
